[[{"id": 0, "text": "I know that the current game of football is known as gridiron football. Do you play?", "intent": []}, {"id": 1, "text": "No, but my nephew does.  Gridiron is an American sport played with a round ball.  Have you ever played?", "intent": []}, {"id": 2, "text": "I have not played the game before, but I love watching it! How long have you been playing?", "intent": []}, {"id": 3, "text": "Since I was a kid.  My grandpa used to play and taught me.  I love the tackle and that is the most important part of the game.  ", "intent": []}, {"id": 4, "text": "Do you have any other hobbies besides football?  I like to go to rock concerts.", "intent": []}, {"id": 5, "text": "I enjoy camping.  It is nice to get away from the city for a while. ", "intent": ["FindAttractions"]}, {"id": 6, "text": "I have never camped! I do not have a lot of time to do much of anything these days.", "intent": []}, {"id": 7, "text": "Do you live in the city or a rural area?  That makes a difference in the amount of time you have available. ", "intent": []}, {"id": 8, "text": "I live in a city. The nearest big city is about 2 hours away.  How about you?", "intent": []}, {"id": 9, "text": "I live about 20 minutes from a major city.  Not too close, but not too far either.", "intent": []}], [{"id": 0, "text": "I do. I have 2 boys and 3 girls. How about you? Do you have any kids?", "intent": ["FindAttractions"]}, {"id": 1, "text": "I do! I have 3 boys. I never thought I'd have any of my own, but I love them so much. How old are your kids? ", "intent": ["FindAttractions"]}, {"id": 2, "text": "13, 14, and 17. Do you get to spend a lot of time with your children?", "intent": ["FindAttractions"]}, {"id": 3, "text": "Yes, I have a lot because I own my marketing consultancy business. What about you, do you also have kids?", "intent": ["FindAttractions"]}, {"id": 4, "text": "I don't have any, but my husband is thinking of adopting so maybe some day! You have your own business?", "intent": []}, {"id": 5, "text": "No, not yet. But hopefully someday! If you do, be sure to follow your heart.", "intent": []}, {"id": 6, "text": "Thank you for the encouragement! What do you like to do for fun? Anything outdoors?", "intent": ["FindAttractions"]}, {"id": 7, "text": "I love hiking! I also love the outdoor, especially in the fall. What's your favorite thing to do?", "intent": ["FindAttractions"]}, {"id": 8, "text": "That sounds like fun! I love to watch nature documentaries! Do you like nature a lot?", "intent": ["FindMovies"]}, {"id": 9, "text": "I like nature documentarys, especially those about wildlife. What kind of foods do you enjoy?", "intent": []}], [{"id": 0, "text": "All kinds of weird stuff. My cousin was weird to me. What about you?   ", "intent": ["FindAttractions"]}, {"id": 1, "text": "I like weird stuff as well! What are some of your hobbies?  Mine are cheer leading and hanging out outside.", "intent": []}, {"id": 2, "text": "I'm not much of a social person, which is probably why I like to shop so much. Do you have any friends?", "intent": []}, {"id": 3, "text": "Yes. I've a lot of friends who are cheersleaders! Do you like shopping?", "intent": ["FindAttractions"]}, {"id": 4, "text": "That's awesome! And I really like shopping! Shopping is so relaxing.  What kind do you like?", "intent": ["FindAttractions"]}, {"id": 5, "text": "I like clothing, accessories, and furniture. Doctors always have great deals on those!", "intent": []}, {"id": 6, "text": "That's always a good thing. What type of furnishings do you tend to buy?", "intent": []}, {"id": 7, "text": "I like buying furnished stuff that is made from recycled material! What do you do for work?", "intent": []}, {"id": 8, "text": "That sounds really interesting. I work in a factory. How about you, do you work? ", "intent": []}, {"id": 9, "text": "Yes, I work at a bakery as a baker. What do your coworkers do there?", "intent": []}], [{"id": 0, "text": "It was.  The plumber came and fixed it.  It was traumatizing though!", "intent": []}, {"id": 1, "text": "I'm sure it was very scary. Glad you're ok. What do you do for work?", "intent": []}, {"id": 2, "text": "I have a real estate agency.  How about you?  You have a job?", "intent": []}, {"id": 3, "text": "Yes, I am a writter. Are you married? Do you have children?  I love it!", "intent": []}, {"id": 4, "text": "I have three children. They are great kids. How many do you have?  What kind of writer?", "intent": ["FindAttractions"]}, {"id": 5, "text": "Fiction mostly.  Do you enjoy reading?  It is my passion.  What do your kids like?", "intent": ["FindMovies", "FindAttractions"]}, {"id": 6, "text": "They like to swim. I don't get much time to read anymore. What books do you like? ", "intent": []}, {"id": 7, "text": "Mostly fiction.  My favorite book is \"Cowboy\" by David Mitchell.", "intent": ["FindMovies"]}, {"id": 8, "text": "I will have to look into that. Do you like the tv show?  it is based on the book.", "intent": []}, {"id": 9, "text": "I have heard a lot about it. Has it had good reviews? I'll have to check it out.", "intent": []}], [{"id": 0, "text": "wow, that is quite a commitment. What team do you like the most?   I like the Packers.", "intent": []}, {"id": 1, "text": "I like them too. I am more of a Patriots fan, but Packer is cool too", "intent": []}, {"id": 2, "text": "I like Tom Brady too, he is a great QB.  I also like the Chicago Bears. ", "intent": []}, {"id": 3, "text": "A lot of people like the Bears! They're my 2nd favorite team behind the Seattle Seahawks", "intent": []}, {"id": 4, "text": "Seattle is a good team.  They have won the NFL's most recent Super Bowl.", "intent": []}, {"id": 5, "text": "That's awesome. They've won 5 Super Bowls since they started playing in the Super Bowlient", "intent": []}, {"id": 6, "text": "Who is your favorite team?  How long have you been watching the NFL?  I've been following the Bengals since they were founded in 1961.", "intent": []}, {"id": 7, "text": "My favorite team is the Chiefs. I have been watching them since 2001. They are the best!", "intent": []}, {"id": 8, "text": "Awesome.  The Chief's are a great team. They have consistently been a powerhouse in the NFC.", "intent": []}, {"id": 9, "text": "They sure have! They are one of the best teams of the National Field Hockey League.", "intent": []}], [{"id": 0, "text": "Yeah, I apologized and explained that it was a misunderstanding. I was more embarassed then anything.", "intent": []}, {"id": 1, "text": "I would be too, it's all part of life though. I'm sure they got over it.", "intent": []}, {"id": 2, "text": "It really is! What do you do for work? I just started working online. I love it. ", "intent": ["FindMovies"]}, {"id": 3, "text": "I'm a publisher for a large newspaper company. What kind of online work are you doing?", "intent": []}, {"id": 4, "text": "I'm an editor at an online publishing company. It's a lot of fun. What do your parents do? ", "intent": ["FindMovies"]}, {"id": 5, "text": "My dad is retired now, but he was a cop for 30 years. He was a good one.", "intent": []}, {"id": 6, "text": "That's awesome. It sounds like you have a great family life. Do you have any siblings?", "intent": []}, {"id": 7, "text": "I do! I've 2 brothers and one sister. What about you? . .", "intent": []}, {"id": 8, "text": "I've an older sister, and a younger brother. We get along well. How about you??", "intent": []}, {"id": 9, "text": "I do. My sister is a bit younger than me, but we get along as well. What else do you like to do?", "intent": []}], [{"id": 0, "text": "Yes I do like novel. What do you like to read?  What is your favorite food?", "intent": []}, {"id": 1, "text": "I like Romance novels and history books. My favorite food is Italian!  What about you?", "intent": []}, {"id": 2, "text": "Mine is pasta! I'm a ballerina so I like to make it at home.", "intent": []}, {"id": 3, "text": "I love pasta too!  Do you have any hobbies?  I write.  It is a passion of mine.", "intent": []}, {"id": 4, "text": "That's great! What genre do you write? I love romance novel. Do you like watching movies?", "intent": ["FindMovies"]}, {"id": 5, "text": "I write supernatural fiction.  Yes, I love watching movies.  Do any favourites?", "intent": ["FindMovies"]}, {"id": 6, "text": "Yeah, I really love the movie Finding Nemo. Have you seen it? What else do you do for fun?", "intent": ["FindMovies"]}, {"id": 7, "text": "I have seen it a few times.  I also like cooking.  What do other people do for a living?", "intent": []}, {"id": 8, "text": "I enjoy cooking too. I am a freelance graphic designer. What about yourself?", "intent": []}, {"id": 9, "text": "I'm self employed in marketing.  How long have you been doing graphic work? ", "intent": []}], [{"id": 0, "text": "That's cool. I've never actually seen it, although I know a few of my friends are really into it.  What is your favorite episode?", "intent": ["FindMovies"]}, {"id": 1, "text": "My favorite episode of Star Treck is probably the first episode of \"The Next Generation\" I watched. It premiered in 1994.", "intent": []}, {"id": 2, "text": "I would say mine would be the 2009 film Star Treks: The Undiscovered Country.", "intent": []}, {"id": 3, "text": "I haven't seen that one, but the original series was great. I also like the reboot series Star TreK: Generation.", "intent": ["FindMovies"]}, {"id": 4, "text": "There have been many, many, different reboots of Star trek: Generations.  I think I've seen the first one.", "intent": []}, {"id": 5, "text": "Generation is probably my favorite Star Trex film. It was made by Gene Roddenberry.", "intent": ["FindMovies"]}, {"id": 6, "text": "The film stars Gene and James T. Kirk.  Those guys were great.  Have you seen any of the movies?", "intent": ["FindMovies"]}, {"id": 7, "text": "I have seen a few. Toy Story and Jurassic Park are two of my favorites.", "intent": ["FindMovies"]}, {"id": 8, "text": "Those are great as well.  It's amazing to think that all of those movies came out in 1995.", "intent": ["FindMovies"]}, {"id": 9, "text": "I know, and they were all directed by Michael Bay.  He is an amazing director.", "intent": ["FindMovies"]}], [{"id": 0, "text": "That would be fun.  I would love to visit there someday.  Do you travel often?", "intent": ["FindAttractions"]}, {"id": 1, "text": "I do. I like to take long walks on the beach. Mexico is beautiful. I recommend visiting!", "intent": ["FindAttractions"]}, {"id": 2, "text": "I would definitely like to visit.  Have you ever been to Ecuador?  I hear it's quite beautiful too.", "intent": []}, {"id": 3, "text": "No, I haven't but it is on my bucket list! I'm sure it is beautiful, especially with all the wonderful landscape there.", "intent": ["FindAttractions"]}, {"id": 4, "text": "It sure sounds great!  I hope you're able to make your bucketlist happen.  :)", "intent": []}, {"id": 5, "text": "I sure hope so too! Thanks so much for being so nice to chat with me. Have a great day!", "intent": []}, {"id": 6, "text": "You as well!  Thanks for the chat.  Enjoy the rest of your day.  :D", "intent": []}, {"id": 7, "text": "Thank you so much! I really appreciate it! Have a good day! :) Bye! :)", "intent": []}, {"id": 8, "text": "You aswell!  Have a nice day. :D Bye.  ;)  XD", "intent": []}, {"id": 9, "text": "Hahaha! Hope you have a great rest of the day! See ya! :) Have a wonderful day!", "intent": []}], [{"id": 0, "text": "Oh man.  I'm so sorry.  My condolences.  Do you have any other pets?", "intent": []}, {"id": 1, "text": "My other cat is black and white like my dogs.  What about you?  What do you have?", "intent": []}, {"id": 2, "text": "I don't have any pets but I'd love to have a dog. What do your pets like to eat?", "intent": []}, {"id": 3, "text": "My pets eat mostly lettuce and veggies.  They are a big help when I go to comedic clubs.", "intent": []}, {"id": 4, "text": "That's very interesting.  Are comedians your favorite comedians?  Are you a comedian yourself?", "intent": []}, {"id": 5, "text": "Yes, I do comedy.  Comedians are my favorite.  Who's yours?", "intent": ["FindMovies"]}, {"id": 6, "text": "I love Carrey and Amy Poehler the most.  Have you heard any of their material?", "intent": []}, {"id": 7, "text": "No I haven't. What kind of comedy is that? Is it just stand up or is it other types?", "intent": ["FindMovies"]}, {"id": 8, "text": "Stand up.  It's a comedy television show.  If you liked it, you should check it out.", "intent": ["FindMovies"]}, {"id": 9, "text": "I might check it on Netflix. Thanks for the suggestion! What else do you like to do for fun?", "intent": []}], [{"id": 0, "text": "Wow that's so cool. Do you read a lot? I'm a big reader myself.", "intent": []}, {"id": 1, "text": "Yeah, I love to read. I love fantasy novels, especially Harry Potter. What do you read?", "intent": ["FindMovies"]}, {"id": 2, "text": "I love romance novels. I also like fantasy. My favorite book is Middles Ex. What's yours?", "intent": ["FindMovies"]}, {"id": 3, "text": "Romance and fantasy are fun too. My favorites are Harry Pottery and Game of Thrones.", "intent": ["FindMovies"]}, {"id": 4, "text": "Yes, I also enjoy Game of thrones. Have you read the books? I am reading them again right now.", "intent": []}, {"id": 5, "text": "No I haven't. I watched the show though and loved it. What other shows do you enjoy?", "intent": ["FindMovies"]}, {"id": 6, "text": "Breaking Bad is pretty good too. It is one of the most popular shows on TV. What about you?", "intent": ["FindMovies"]}, {"id": 7, "text": "I like the big bang theory. I watch it every sunday. It's one of my favorites.", "intent": ["GetTimesForMovie"]}, {"id": 8, "text": "I've never watched it. I have heard a lot about it though. Is it like a typical sitcom?", "intent": ["FindMovies"]}, {"id": 9, "text": "I guess you could consider it a sitcom. It was created by Adam Levine and Stephen Hillenburg.", "intent": ["FindMovies"]}], [{"id": 0, "text": "I love watching food network! It's my favorite too. What's your favorite show on there?", "intent": []}, {"id": 1, "text": "i like to watch cooking shows . like food network . what about you ? what shows do you like?", "intent": []}, {"id": 2, "text": "Oh, that's awesome! I love to watch Chopped. Do you have a favorite?", "intent": []}, {"id": 3, "text": "i love chopped as well . my wife and i love to binge watch those shows .", "intent": ["FindMovies"]}, {"id": 4, "text": "That's so funny. What do you and your wife do for fun? Are you in school?", "intent": []}, {"id": 5, "text": "yes we are , working towards getting a bachelors in business administration.  what about yourself?", "intent": []}, {"id": 6, "text": "I'm doing just fine. My major is in business. What would you like to do with your degree?", "intent": []}, {"id": 7, "text": "I would love to get my bachelor's in accounting.  I am currently a waitress, but I'd like to be a manager.  What do people do for a living?", "intent": []}, {"id": 8, "text": "I have a part time job as well. I'm a teacher. How long have you been working as a waiter?", "intent": []}, {"id": 9, "text": "a little over 10 years.  How long did you work as teacher?  i've always admired teachers", "intent": []}], [{"id": 0, "text": "For about 2 years! I've been spending a lot more time with him lately, though. He's a little intimidated by some of the stuff I'm teaching him.", "intent": []}, {"id": 1, "text": "That's awesome, I hope he continues to do well. What kind of dog is he? ", "intent": []}, {"id": 2, "text": "He's an Australian Shepherd. What is your dog's name?  How old is he/she?", "intent": []}, {"id": 3, "text": "My dog is named Bella, she's a golden retriever. I've never had a dog in my life!", "intent": []}, {"id": 4, "text": "I've always wanted a golden! They're such sweethearts! I'm happy for you! ", "intent": []}, {"id": 5, "text": "Thanks! They really are. They're one of the most loyal breeds. What other dogs have you owned?", "intent": []}, {"id": 6, "text": "I've had a few other small dogs. My favorite is a Border Collie.  do you have any other pets?", "intent": []}, {"id": 7, "text": "I've a chihuahua. I got him because my boyfriend loves puppies, haha.", "intent": []}, {"id": 8, "text": "I love Chihuhuas! They have such unique personalities! How old are the puppers?", "intent": []}, {"id": 9, "text": "They are both 4. Do you have a specific breed of dog?  Dogs are my favorite.", "intent": []}], [{"id": 0, "text": "That sounds like a lotta fun. Do you have any favorite cartoons?   I really love Hanna-barbera.", "intent": ["FindMovies"]}, {"id": 1, "text": "That's one of my favorites! I was addicted to my little Pony when I was a kid, and I think I still am.", "intent": ["LookupMusic"]}, {"id": 2, "text": "I like to watch Hanna Barbera cartoones when I eat my favorite food, pizza!", "intent": []}, {"id": 3, "text": "I love pizza! My friends and I like eating pizza while we play video games. Have you played any online games?", "intent": []}, {"id": 4, "text": "I've played a little Starcraft. I like MMO games. What kind of games do you play?", "intent": []}, {"id": 5, "text": "I play MMOs too! My favorite is Diablo 3. My friends don't really play any other games, though.", "intent": []}, {"id": 6, "text": "I've never played Diabolo 3. What is your favorite part of playing it? ", "intent": ["PlaySong"]}, {"id": 7, "text": "My favorite part is the story and I love how much action there is in the game!  What is yours?", "intent": []}, {"id": 8, "text": "My favorite thing about Diablo is the multiplayer. I play it with a group of friends online. It is pretty fun.", "intent": []}, {"id": 9, "text": "That's great! What kind if games do your friends play? What is a multiplayer online game?", "intent": []}], [{"id": 0, "text": "That is interesting, do you have any hobbies? I like collecting vintages. ", "intent": []}, {"id": 1, "text": "I sell insurance for a living. What is your favorite vintage?  Blue is my favorite too", "intent": []}, {"id": 2, "text": "I like blue as well. Do you own a car or have one that is blue?  ", "intent": []}, {"id": 3, "text": "I don't own one, but I do like to borrow cars from friends and family occasionally.", "intent": []}, {"id": 4, "text": "What kind of cars do you like to work with?  I work on classic cars.  It's a lot of fun.", "intent": []}, {"id": 5, "text": "I don think I've ever borrowed a car. I've always wanted to, though.", "intent": []}, {"id": 6, "text": "Do you have a favorite color?  Mine is blue.  Blue has always been one of my favorite colors. ", "intent": []}, {"id": 7, "text": "Mine too.  What do you do for a job? I work at a movie theater.", "intent": []}, {"id": 8, "text": "I'm a financial analyst. How long have you been working there? I've been working for a few years now.", "intent": []}, {"id": 9, "text": "I've only been working here for a couple of years. How do you enjoy finance? I imagine it requires a lot more study.", "intent": []}], [{"id": 0, "text": "That is very cool.  I would be really scared to be in a self driving one.  What do you do for a living?", "intent": []}, {"id": 1, "text": "I work in marketing. How about you? What kind of career path do you have?  ", "intent": []}, {"id": 2, "text": "I'm a graphic designer, but I'd love to work on self-driving cars. ", "intent": []}, {"id": 3, "text": "Oh, wow! That sounds cool. I'm not familiar with designing cars, but it sounds like you would have an interesting job.", "intent": []}, {"id": 4, "text": "Yes, that's why I chose to become a graphical designer.  It seems like an easy and lucrative career. ", "intent": []}, {"id": 5, "text": "That's good. Are you into graphic arts in general? Is graphic art your passion?", "intent": ["FindMovies", "FindAttractions"]}, {"id": 6, "text": "No, I'm actually not too into it.  But I can see how it could be a fun hobby to share.  You?", "intent": []}, {"id": 7, "text": "I love it! I particularly love graphic novels, since they involve different forms of visual art such as animation, photography, computer graphics, illustration, etc.", "intent": ["FindMovies"]}, {"id": 8, "text": "I guess I should check out some of those types of graphic books.  Are there any good ones you'd recommend?", "intent": ["FindMovies"]}, {"id": 9, "text": "I've only recently started reading this genre, so I'm only beginning to get into it, but the best ones are DC and Marvel for sure.", "intent": []}], [{"id": 0, "text": "Wow, that's impressive. I read a lot of romance books when I work at the grocery. Do you like reading books?", "intent": ["FindMovies"]}, {"id": 1, "text": "I do, I like crime fiction and historical fiction. What about you?  ", "intent": ["FindMovies"]}, {"id": 2, "text": "I also like crime books. They are a lot more interesting than typical romance. What's your favorite crime book?", "intent": ["FindMovies"]}, {"id": 3, "text": "A little secret, but my favorite is \"The Berenstain Bears\" - it's a mystery.", "intent": ["FindMovies"]}, {"id": 4, "text": "I love mysteries! My dad used to read those to me when I was a kid. ", "intent": ["FindMovies", "FindAttractions"]}, {"id": 5, "text": "That's awesome! They're so interesting, and unique because they usually deal with the supernatural.", "intent": []}, {"id": 6, "text": "What else do you do for fun? I'm a very social person, so I like to hang out with friends and play sports.", "intent": []}, {"id": 7, "text": "I love to read, and I also play the drums. What kind of sports do you play?", "intent": []}, {"id": 8, "text": "I play soccer. I'm in a very competitive league, and we practice 5 days a week. ", "intent": []}, {"id": 9, "text": "That's a lot! How long have you been playing?  I know my mom's been playing for 30 years.", "intent": []}], [{"id": 0, "text": "i am sorry to hear that. do you have any hobbies?  what are some of your hobbies", "intent": []}, {"id": 1, "text": "I like to play video games and watch movies. What about you? Are you busy with school or work?", "intent": []}, {"id": 2, "text": "yes, I work part time at a cafeteria and school part time. what about you", "intent": []}, {"id": 3, "text": "I am a full time student as well. How long have you been working at the cafetia?", "intent": []}, {"id": 4, "text": "three years. what is your major? I'm studying education.   What are you studying?", "intent": []}, {"id": 5, "text": "It is a bachelor's degree in education. what kind of work do you do? ", "intent": []}, {"id": 6, "text": "I work as a financial analyst. What do you want to do once you graduate?", "intent": []}, {"id": 7, "text": "I'm not sure yet. Financial Analyst sounds interesting though. What kind of hours do you work?", "intent": []}, {"id": 8, "text": "I work every day as a realtor. I love it. what do you like to do?", "intent": []}, {"id": 9, "text": "I like painting. It is relaxing. Do you have hobbies or do you stay at home?", "intent": []}], [{"id": 0, "text": "Maybe one day you could overcome that fear. What kind of projects do you have in front?", "intent": []}, {"id": 1, "text": "I am currently working as an accountant.how about you?.What kind of hobbies do you enjoy?", "intent": []}, {"id": 2, "text": "I like fishing and making boats. What do you do for a living?  What do your family do?", "intent": []}, {"id": 3, "text": "I am an accounting assistant, but I am looking for a new job. My family is very spread out. How about yours?", "intent": []}, {"id": 4, "text": "My family lives near me, but have moved a few times. I don't have a lot of family anymore. ", "intent": []}, {"id": 5, "text": "I am sorry to hear that. I do not think I could handle moving all the time. Do you have any siblings?", "intent": []}, {"id": 6, "text": "No, I am the only one. My sibling had a rough childhood.  How about you, do you?", "intent": []}, {"id": 7, "text": "I'm an only child, as well. But I hope to adopt an older brother or sister some day. ", "intent": []}, {"id": 8, "text": "That is so nice of you to want to help the less fortunate! What kind if job are you looking for?", "intent": []}, {"id": 9, "text": "I'd like to be a lawyer. What about you. Do YOU have any hobbies? ", "intent": []}], [{"id": 0, "text": "What type of job are you applying for? What do you do for a living?  ", "intent": []}, {"id": 1, "text": "I applied for a lawyer position. I will be a paralegal. I would love to be a lawyer. What kind of job do you want?", "intent": []}, {"id": 2, "text": "I want to be an accountant. What made you want to become a paralgal? ", "intent": []}, {"id": 3, "text": "Well, my parents were both lawyers, and so they got me into the field. What do your parents do?", "intent": []}, {"id": 4, "text": "My parents are not very close. They were both military, so they were always busy.  ", "intent": []}, {"id": 5, "text": "Well, I hope your parents can get closer to you someday. What is your favorite holiday? Mine is Christmas.", "intent": []}, {"id": 6, "text": "I love Halloween! Hallowe'en is my favorite holidays!  Do you like halloween? ", "intent": []}, {"id": 7, "text": "Yes! I love going trick or treating in my neighborhood. Do you have any kids? .", "intent": ["FindAttractions"]}, {"id": 8, "text": "No, I don't have any children. I do not know if I'm ready for kids.", "intent": ["FindAttractions"]}, {"id": 9, "text": "I think you will be, if you love kids and want them.  What else do you like to do in your spare time?", "intent": ["FindAttractions"]}]]