[[{"id": 0, "text": "That is great! How long has she been alive?    I have a mom who is as well.", "intent": []}, {"id": 1, "text": "That is awesome. My wife and kids are overseas right now. I miss them! lol", "intent": ["FindAttractions"]}, {"id": 2, "text": "Wow.  Where did they go?  I've never been oversees.  Hopefully one day.", "intent": []}, {"id": 3, "text": "They went to China. I have been over seas a few times and would love to go back", "intent": []}, {"id": 4, "text": "I hear good things about China.  What did you do there?  Did you like it?", "intent": ["FindAttractions"]}, {"id": 5, "text": "I went to watch a movie. It was really fun. I would love for my wife and I to go again", "intent": ["FindMovies"]}, {"id": 6, "text": "What movie did you see?  Do you have any travel plans?  It would be nice to travel!", "intent": []}, {"id": 7, "text": "We saw the lion king. I do not have any plans right now, maybe one day!", "intent": []}, {"id": 8, "text": "I saw the Lion King when I was a kid!  I still think it's the best movie ever!", "intent": ["FindMovies"]}, {"id": 9, "text": "I've heard that it's a really good one! I will have to see it sometime!", "intent": ["GetTimesForMovie"]}], [{"id": 0, "text": "That is a great name for a cat.  What do you do for a living?  I work in marketing.", "intent": []}, {"id": 1, "text": "Marketing is cool.  I love working online.  Do you have any hobbies?", "intent": ["FindMovies"]}, {"id": 2, "text": "Yes, I like the gym and surfing.  How about you?  What's your favourite hobby?", "intent": []}, {"id": 3, "text": "I like playing guitar.  It is soothing to me.  Surfing sounds fun, too.  Where do you surf?", "intent": []}, {"id": 4, "text": "I like to go to the beach near my home.  There are never any waves there though.", "intent": []}, {"id": 5, "text": "That's cool. I've always wanted to surf in the ocean. I don't live near a beach.", "intent": ["FindAttractions"]}, {"id": 6, "text": "Well, I hope you get to experience it someday.  You just have to find the right spot.", "intent": []}, {"id": 7, "text": "I think I'll try in a river first. I haven't been to the oceans yet.", "intent": []}, {"id": 8, "text": "It seems like you have a good head on your shoulders.  As long as you know where to go, you'll be fine.", "intent": []}, {"id": 9, "text": "Thank you, I'll keep that in mind. It's nice to be in a place where there's always something to do.", "intent": []}], [{"id": 0, "text": "Yeah, I had to figure out my way back home. It was pretty scary at first. ", "intent": []}, {"id": 1, "text": "How did it turn out? Were you able to find your way back?    - Edit: Do you have any hobbies?", "intent": []}, {"id": 2, "text": "I've finally found my way home. I love baking and watching movies. What about you?", "intent": ["FindMovies"]}, {"id": 3, "text": "I enjoy reading and playing computer games. I spend a lot of time on the computer. How about you, any hobbes?", "intent": []}, {"id": 4, "text": "I don't have any specific hobbies. I just enjoy making new friends and meeting new people. Do you know anyone new around town?", "intent": []}, {"id": 5, "text": "I've been trying to get out and meet new people as well. I meet a lot on the internet though.", "intent": []}, {"id": 6, "text": "That's always great. The internet can be great for meeting new friends. Do they live near you?", "intent": []}, {"id": 7, "text": "No, but I do live close to a few people. What is your favorite sport? I'm a soccer fan.", "intent": []}, {"id": 8, "text": "My favorite sport is soccer as well! I'm not very good at it though. Do like sports?", "intent": []}, {"id": 9, "text": "I like soccer, but not as much as basketball. I'm better at it than basketball.", "intent": []}], [{"id": 0, "text": "No, I live in a small town so it's hard to go anywhere. You?  Do you like to travel?", "intent": []}, {"id": 1, "text": "Yes, I've traveled to many countries. What about you? What kind of music do you like?", "intent": []}, {"id": 2, "text": "I like listening to hip hop, but I like all kinds of music.  Where are your favorite places?", "intent": []}, {"id": 3, "text": "I like Spain, Portugal, Italy, and Greece.   Where do you live?", "intent": []}, {"id": 4, "text": "I live near Phoenix, Arizona. I love it here. What do you do for a living?", "intent": []}, {"id": 5, "text": "I work at a grocery store.  Do not hate it.  It's boring.  How about you, what do you work?", "intent": []}, {"id": 6, "text": "I work as a teacher. It is very rewarding, but sometimes busy. How long have you worked there?", "intent": []}, {"id": 7, "text": "I have been working there since January of last year.  I don't know what I will do if I have to leave.  What grade do you teach?", "intent": []}, {"id": 8, "text": "I teach fourth grade. What grade will you be teaching? Do you have any hobbies?", "intent": []}, {"id": 9, "text": "I am a fifth grade teacher.  My hobbies are going to the gym and I love to cook.", "intent": []}], [{"id": 0, "text": "I think a few. He is a pretty outgoing person so I know it will be good.", "intent": []}, {"id": 1, "text": "That sounds great. I hope you have a great time!    Do you have plans for the night?", "intent": []}, {"id": 2, "text": "I'm going to the beach. It's one of my favorite things to do.  How about you?", "intent": []}, {"id": 3, "text": "I'm actually going to be on a cruise. The beach is great too though.", "intent": []}, {"id": 4, "text": "That sounds fun. I've never been on a boat before.  I bet it's a lot of fun.", "intent": []}, {"id": 5, "text": "I hope so. I'm excited.  Who is your favorite singer?  Mine is Robert Smith.", "intent": ["LookupMusic"]}, {"id": 6, "text": "Mine is Taylor Swift. I think she's so talented.  What do you do for a living?", "intent": []}, {"id": 7, "text": "I work for an airline. It pays the bills, but I'd like to be an astronaut.", "intent": []}, {"id": 8, "text": "That's pretty cool.  Do what you love and all that.  And you'll never have to work a day in your life.", "intent": []}, {"id": 9, "text": "I certainly hope not. It would be nice. What do your parents do? Mine work at a pet store.", "intent": []}], [{"id": 0, "text": "I'm employed at a local museam. It's great.  What about you?", "intent": []}, {"id": 1, "text": "I worked at a pizza place. It was pretty fun. What kind of museum do you work at?", "intent": ["FindAttractions"]}, {"id": 2, "text": "I work at the Reno Museum of Natural History.  It's very large.", "intent": ["FindAttractions"]}, {"id": 3, "text": "Wow, that sounds amazing. I love science. What's your favorite thing to do there? ", "intent": ["FindAttractions"]}, {"id": 4, "text": "I love all the artifacts there.  Science is important.  When I was studying it in school, I was never happy.", "intent": []}, {"id": 5, "text": "I understand that. Science can be scary at times.  Have you ever been to the California Aquarium? It's huge.", "intent": []}, {"id": 6, "text": "No, I haven't, but I'll have to check it out.  California is pretty wild, isn't it?", "intent": ["FindAttractions"]}, {"id": 7, "text": "It sure is. The museums there are great. The Smithsonian is there, too.", "intent": ["FindAttractions"]}, {"id": 8, "text": "I didn't know that.  Maybe I'll go there this summer.  Thanks for the suggestion.", "intent": []}, {"id": 9, "text": "You're welcome. I'm hoping to move to Cali one day. Seems like a really nice place to live.", "intent": []}], [{"id": 0, "text": "Me too! Do you make them yourself? My dad made them for me a lot growing up.", "intent": []}, {"id": 1, "text": "I do! My favorite thing is shrimp and cheese! What's your favorite?  ", "intent": []}, {"id": 2, "text": "I like shrimps and onion! With sauce! What about you?  What do you do for work?", "intent": []}, {"id": 3, "text": "I play baseball professionally! What do do for a living?  Do you have any hobbies?", "intent": []}, {"id": 4, "text": "I work for an insurance agency. I'm looking for another job! What kind of baseball do you play?", "intent": []}, {"id": 5, "text": "I play outfield! I'm a catcher. Do you like football?  I love watching the games.", "intent": []}, {"id": 6, "text": "I love it! Do people ever give you a hard time when you're catching the ball?", "intent": []}, {"id": 7, "text": "No, not really! I try to stay positive.  Are you married?  Any kids?", "intent": ["FindAttractions"]}, {"id": 8, "text": "No, I am not. How about you, any kids? What is your favorite holiday?", "intent": ["FindAttractions"]}, {"id": 9, "text": "I have two daughters and two boys. I love christmas! How about yourself? ", "intent": []}], [{"id": 0, "text": "Yeah, computers are pretty versatile devices. Do you have any hobbies?  I am a professional translator", "intent": []}, {"id": 1, "text": "That's interesting. What language do you translate?    I've a dog. He's a big deal to me.", "intent": []}, {"id": 2, "text": "I love dogs! What is his name?  Do you see him often?  Own any pets?", "intent": []}, {"id": 3, "text": "His name is Simon. I've four dogs and a cat. They're all very spoiled.", "intent": []}, {"id": 4, "text": "I see.  Do they all get along well?  Also, what kind of cat is Simone?", "intent": []}, {"id": 5, "text": "Simon is a tuxedo cat. He likes to lay on your lap and watch you work.", "intent": []}, {"id": 6, "text": "That's so funny!  I have a Siamese cat.  He is a bit feisty, though.", "intent": []}, {"id": 7, "text": "I love Siamee cats! The only thing about my cats that I don't like is their hair!", "intent": []}, {"id": 8, "text": "I understand.  I just have to brush him a lot.  Siamingos are great.", "intent": []}, {"id": 9, "text": "They really are. They were actually the first breed to be imported from China to the US.", "intent": []}], [{"id": 0, "text": "What are you going to school for?  what are you majoring in?  What do you like to do?", "intent": []}, {"id": 1, "text": "I'm majoring psychology and minor in criminal justice, what about you? What kind of work do you want to do with your degree?", "intent": []}, {"id": 2, "text": "I am majoring business management!  I want to own a small business one day.  What is your major?", "intent": []}, {"id": 3, "text": "I'm a psych major, but I really want to have my own business one of these days!", "intent": []}, {"id": 4, "text": "Do you have a specific area of business in mind?  Or do you not know yet? ", "intent": []}, {"id": 5, "text": "Yes, I really would like to open a phone repair shop and serve food!  What about you, what kind of business do you think you'd like to start?", "intent": []}, {"id": 6, "text": "I would like a financial business.  I think there is a lot of opportunity in that field.  ", "intent": []}, {"id": 7, "text": "What kind if business would you like?  I'd like a restaurant, dining, or even a bar.", "intent": []}, {"id": 8, "text": "I think a restaurant would be fun!  Do they have restaurants in prison?  That would be a good idea!", "intent": []}, {"id": 9, "text": "I'm not sure if they have any in prison but if I ever move to a city, there are plenty of food trucks!", "intent": []}], [{"id": 0, "text": "That's true. Vegetables are a great source of good nutrition. Do you have a favorite way to prepare them?", "intent": []}, {"id": 1, "text": "i like fresh vegetables from my garden but i don't cook much. what about you?", "intent": []}, {"id": 2, "text": "i also enjoy fresh veggie. What vegetable do you grow in your garden? ", "intent": []}, {"id": 3, "text": "i grow tomatoes, cucumbers, corn, carrots, peppers, broccoli and watermelons. what kind of fruits do you like?", "intent": []}, {"id": 4, "text": "I like those as well! I also like cucumber, tomato, onion, pepper, celery, and lots of different vegetables.", "intent": []}, {"id": 5, "text": "i love peppermint, garlic, and chives the best.  what are your favorite vegetables?", "intent": []}, {"id": 6, "text": "I love all of those aswell! My favorite is broccolli and mushrooms.", "intent": []}, {"id": 7, "text": "broccori is great.  I also love cauliflower, brussels sprouts, watermellon, and green beans", "intent": []}, {"id": 8, "text": "I love caulflower too! It is often served as a side dish for fish.", "intent": []}, {"id": 9, "text": "do you ever use it for guacamole?  that's the best way to have it", "intent": []}], [{"id": 0, "text": "I had a steak and potatoes dish. It was very delicious. What would you recommend?", "intent": []}, {"id": 1, "text": "I love steak! The meat was medium rare. I like my steaks well done. ", "intent": []}, {"id": 2, "text": "I like mine well done as well. I try to stay away from steak when I go out with friends though.", "intent": []}, {"id": 3, "text": "Same here! I always have to order my steak well done! How is your job going?", "intent": []}, {"id": 4, "text": "It is going well. Working in retail has it's ups and downs. How about you?", "intent": []}, {"id": 5, "text": "I am an assistant teacher. I really enjoy it. What is your favorite food? Mine is pizza.", "intent": []}, {"id": 6, "text": "I love pizza as well! I'd have to say Chicken Alfredo. ", "intent": []}, {"id": 7, "text": "I love chicken alfredo! It is so good. How do you like to cook your chicken?", "intent": []}, {"id": 8, "text": "I like to grill it with some breadcrumbs and melted butter.  What do you do for a living?", "intent": []}, {"id": 9, "text": "That sounds good! I work in retail. What do your parents do? I am a full time student.", "intent": []}], [{"id": 0, "text": "Yes, I am. I use all my money to buy meat. I love meat! How about you?", "intent": []}, {"id": 1, "text": "I am the same way, I spend all of my money on raw onions though. They're my favorite.", "intent": []}, {"id": 2, "text": "I love onions too! I just learned that an onion is a genus of biennial plants. Do you know a good place for them?", "intent": []}, {"id": 3, "text": "Onions are considered to be a world vegetable. So I use them in just about everything.", "intent": []}, {"id": 4, "text": "That is great! They're really good for you. I can't believe that they're one of the most common vegetables in the world! ", "intent": []}, {"id": 5, "text": "Me neither, that's why I spend a lot of money on them. Plus I like eating them raw.", "intent": []}, {"id": 6, "text": "The \"wild onion\" is actually a part of the onion family! I didn't know that until recently either!", "intent": []}, {"id": 7, "text": "Awesome! I'm glad I know about that. Onions have been cultivated for thousands of years.", "intent": []}, {"id": 8, "text": "Yes! They started to be used in cooking with onions in the 4th millennium BCE!", "intent": []}, {"id": 9, "text": "Really? That's interesting, I did not know that! Onions were brought to Europe from China in the 10th century!", "intent": []}], [{"id": 0, "text": "Actually, not really. I don't know how I did it. It did make me a little self-conscious though.", "intent": []}, {"id": 1, "text": "I'm sure it was great for the interview though!  I am sure you did great!  It happens to everyone.", "intent": []}, {"id": 2, "text": "Thanks, I hope so! I had been working online for years so I'm hoping it goes well.", "intent": []}, {"id": 3, "text": "That is great.  I hope you get the job!    It is good to be prepared. ", "intent": []}, {"id": 4, "text": "I know it is.  Being prepared is always the best thing to do.  What is the job?", "intent": []}, {"id": 5, "text": "I'm an accountant. It's not exactly exciting, but it'll get me by! ", "intent": []}, {"id": 6, "text": "That is good.  That should make you a lot of money.  Do you like it?", "intent": []}, {"id": 7, "text": "Yeah I love it! I get to work with numbers all day. What do you do? ", "intent": []}, {"id": 8, "text": "I work with computers.  It can be boring at times, but I enjoy it.  Yes, working with numbers can be very challenging.", "intent": []}, {"id": 9, "text": "I agree. I have been working with computers all my life. What type of computer do you work with? ", "intent": []}], [{"id": 0, "text": "It's a good thing you have a supportive family. Do you play video games? I'm addicted to them myself.", "intent": []}, {"id": 1, "text": "I love them! I work in the circus and they give us a lot of free time.", "intent": []}, {"id": 2, "text": "That is awesome! I also love to go to the circuses, but I don't get to go as often as I'd like.", "intent": ["FindAttractions"]}, {"id": 3, "text": "Do you go to a circuses with elephants? I would like to go but they are very expensive!", "intent": []}, {"id": 4, "text": "I do! It's very expensive, but it's definitely worth it. It is the biggest circus in the world, right?", "intent": []}, {"id": 5, "text": "I'm not sure if it is the largest, but definitely the largest that I've seen in person.", "intent": []}, {"id": 6, "text": "I know that it is, or at least the biggest one in the US. It's the largest in New Zealand as well.", "intent": []}, {"id": 7, "text": "Wow, that's amazing! I hope one day I can go. It seems like an exciting place.", "intent": []}, {"id": 8, "text": "Have you ever seen an elephant in the wild? It's pretty amazing.  I hope you get to experience it as well!", "intent": []}, {"id": 9, "text": "I have never seen one in person, but have always been interested in them. It must be amazing to see one in its natural habitat.", "intent": ["FindAttractions"]}], [{"id": 0, "text": "It was crazy! But I'm glad she's keeping us busy so we don't have to deal with the craziness.", "intent": []}, {"id": 1, "text": "So true! It was nice talking to you and I hope you and your family enjoy your trip to Hawaii!", "intent": []}, {"id": 2, "text": "Thank you! Have you been to Hawii before? I'd love to go someday.", "intent": []}, {"id": 3, "text": "I would love to visit Hawai'i. It's one of my favorite states to visit. Have you ever been?", "intent": []}, {"id": 4, "text": "No, I've never been, but I've always wanted to go. It sounds like it would be so beautiful.", "intent": []}, {"id": 5, "text": "It really is. It is on the mainland of Hawaiian Islands, so there's so much to see. ", "intent": []}, {"id": 6, "text": "That sounds great. I'm sure it's gorgeous there!  Do you have any fun plans this weekend?", "intent": ["FindAttractions"]}, {"id": 7, "text": "I'm going to a party this weekend. How about you?  Have anything fun planned? ", "intent": []}, {"id": 8, "text": "I've been planning a trip to San Diego.  I used to live there and I miss it.", "intent": []}, {"id": 9, "text": "Oh, I bet you miss it a lot. Did you have many friends in San DIgo?", "intent": []}], [{"id": 0, "text": "Thank you!  Hopefully I don't make a fool of myself.  I have never done anything like this in my life.", "intent": []}, {"id": 1, "text": "You will be fine, just remember to be confident! I'm sure everything will turn out great!", "intent": []}, {"id": 2, "text": "Thanks!  I'm hoping everything goes well.  What are you up to?  Vegetarian as well?", "intent": []}, {"id": 3, "text": "I am not, but I respect other people for that. What about you? How long have you been a vegetarian?", "intent": []}, {"id": 4, "text": "Since I became a vegeterian, I just do not eat red meat, poultry, or seafood.", "intent": []}, {"id": 5, "text": "Oh wow. Why did you decide to become a vegetarian? Is it health-related?", "intent": []}, {"id": 6, "text": "I was just tired of eating red meat.  The eighth century was a long time ago!", "intent": []}, {"id": 7, "text": "Oh yes, that makes sense. Were you watching any documentaries while you were becoming a vegetaraian?", "intent": ["FindMovies"]}, {"id": 8, "text": "Not really.  If I could do it over again, I'd probably do it again.  It's really healthy to be a vegetarian.", "intent": []}, {"id": 9, "text": "Yeah, especially since it would be much healthier if you made sure to get all of the nutrients you need!", "intent": []}], [{"id": 0, "text": "Everything is fine, it is just something I never want to go to the doctor for. I'm a girl btw", "intent": []}, {"id": 1, "text": "I'm sorry you have to deal with that.   Do you have anyone in your life who can help?", "intent": []}, {"id": 2, "text": "I don't I'm an only child. How about you?  Do any of your friends help you?", "intent": []}, {"id": 3, "text": "Yes, one of my best friends is really good at helping me.  Do your friends also help you out?", "intent": []}, {"id": 4, "text": "My friends are my best support. I love them a lot.  What do your friends do for a living?", "intent": []}, {"id": 5, "text": "My friends work for a tech company. I want to work there too someday. What do you do?", "intent": []}, {"id": 6, "text": "I'm in the medical field.  I work with the elderly.  It's a lot of fun.", "intent": []}, {"id": 7, "text": "Wow, that sounds like a rewarding job. I bet you get to meet a lot interesting people!", "intent": []}, {"id": 8, "text": "It's definitely rewarding!  I enjoy it a lot!  So do you have any hobbies?", "intent": []}, {"id": 9, "text": "I like to hike in the mountains. It's the best! Do you? What hobbies do you like?", "intent": []}], [{"id": 0, "text": "They are pretty bad. Hopefully it clears up a lot over the next couple of weeks. What do you like to do for fun?", "intent": []}, {"id": 1, "text": "I like to blog about food and travel. What about you?    Do you have any hobbies?", "intent": []}, {"id": 2, "text": "I just got back from a trip to Italy. What are your hobbies   ? ", "intent": []}, {"id": 3, "text": "I like spending time outdoors. I love camping. What kind of food do you blog?", "intent": []}, {"id": 4, "text": "I like just about any food. But my favorite is chinese food,  how about you ?", "intent": []}, {"id": 5, "text": "I love Italian food. When I went to Italia I fell in love with their food. ", "intent": []}, {"id": 6, "text": "That sounds so great! I would love to try it some day. Where did you go? ", "intent": []}, {"id": 7, "text": "I went on a cruise. Italy is one of the most beautiful and diverse places in the world. ", "intent": []}, {"id": 8, "text": "I have never been on a \"cruise.\" Do you get to go on a lot if you go on one?", "intent": []}, {"id": 9, "text": "I usually go on two or three cruises per year.  I try to keep it local to me. ", "intent": []}], [{"id": 0, "text": "Oh, I love Darjieling teas! Especially the strawberry one. ", "intent": []}, {"id": 1, "text": "That sounds so good! I love collect teapot. My collection is almost as big as my cats.", "intent": []}, {"id": 2, "text": "Oh! That's really cool! How big is your cat collection?   I have had cats in the past!", "intent": ["FindAttractions"]}, {"id": 3, "text": "That's great! I have two cats and a dog! I adore them. What kind of pets do you have?", "intent": []}, {"id": 4, "text": "I have a cat, a dog, a snake and a turtle!  I love my pets.", "intent": []}, {"id": 5, "text": "That is so cool! Do they stay in your home? What are their names? . ", "intent": []}, {"id": 6, "text": "Yes, they stay at my home.  There are six of them.  I don't have their names yet.  Do you have any pets?", "intent": []}, {"id": 7, "text": "I have 2 huskies! They are a lot of work, but I love them! ", "intent": []}, {"id": 8, "text": "That is amazing!  Huskies are my favorite animal!  What do you feed them?", "intent": []}, {"id": 9, "text": "I have to feed them Fruits and veggies!  It takes a lot out of me!  LOL", "intent": []}], [{"id": 0, "text": "I agree with you on that one.  I hate when people are standing too close.  That's my biggest problem.", "intent": []}, {"id": 1, "text": "People who do this are the worst. I am so self-conscious about it.  ", "intent": []}, {"id": 2, "text": "This is so true.  It makes me so angry when people just stand there and watch people do everything.", "intent": []}, {"id": 3, "text": "Yeah. Do you like video games? I love videogames.  What is your favorite?", "intent": []}, {"id": 4, "text": "I love them too!  I like to play Legend of Zelda.  How about you?", "intent": []}, {"id": 5, "text": "I have never played Legend of Zelda before. I have played a lot of World of Warcraft though.", "intent": []}, {"id": 6, "text": "World of warcraft is fun.  Do you play it a lot?  I've never played that one before.", "intent": []}, {"id": 7, "text": "Not as much as I used to. But I still play when I have time. How about yourself?", "intent": []}, {"id": 8, "text": "I don't have much time for video games anymore, but I still love fantasy type stuff. ", "intent": ["FindMovies"]}, {"id": 9, "text": "That is understandable. What kind of fantasy stuff do you like? Do you have any children?", "intent": ["FindMovies", "FindAttractions"]}]]