[
    {
        "intent_pos": 0,
        "dialogue": [
            "What time is the movie playing?",
            "What movie do you want to see and when and where do you want to see it?",
            "Hellboy is the movie I want to see and I want to see if in Santa Rosa on the 4th of this month.",
            "It is playing at [show_time] in [theater_name].",
            "What is their location?",
            "They are located at [street_address]?",
            "How much money does a ticket cost?",
            "The cost is [price] a person.",
            "That is great. I need a Regular cab for 2 people to get there.",
            "You want a [ride_type] cab for [number_of_seats] people and your destination is [destination]. Is that right?",
            "No, I want a Luxury cab for 1 person.",
            "You want a [ride_type] cab for [number_of_seats] person. Is that right?",
            "That is right. Can you tell me the price?",
            "Your ride is confirmed and is coming to get you now. The price is [ride_fare].",
            "How many minutes will it take for it to arrive here?",
            "It will arrive in [wait_time] minutes.",
            "Thanks a bunch.",
            "Do you need something more?",
            "No, that is all. Thanks.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When can I look at it?",
            "Which movie are you interested in seeing? Also, where and when would you like to see it?",
            "I'd like to see Wild Nights with Emily in San Rafael on the 1st.",
            "That movie is airing at [theater_name] on the 1st at [show_time].",
            "Perfect.",
            "Shall I purchase tickets for you?",
            "No. I'll buy the tickets at the theater, but could you book me a taxi to take me there? I'd like a pool ride for four people to 1118 4th Street.",
            "You want a pool ride for [number_of_seats] to [destination]?",
            "Actually, I feel like showing off. Get me a luxury ride for fou... ah, I forgot I was fighting with her... Make that just a ride for three.",
            "You want a luxury ride for [number_of_seats]?",
            "That's right. When will the taxi be here? And what's its cost?",
            "The taxi is booked and should be here in about [wait_time] minutes. It costs [ride_fare].",
            "Thank you very much. I don't need anything else.",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time can I watch it at Boulevard Cinema?",
            "In which city are you planning to watch it?",
            "I'm looking for movies in Petaluma.",
            "Do you have any date in mind?",
            "I would prefer to watch it on March 5th.",
            "Are you looking for a specific movie?",
            "Yes, I want to watch the Missing Link.",
            "There is one show at [show_time] in [theater_name].",
            "How much does the ticket cost?",
            "The ticket rate is [price] per person.",
            "What is the genre of the movie? Can you also find me the address of the theater?",
            "It's a [genre] and the address of the theater is [street_address].",
            "Thank you. Can you help me find a cab to get there?",
            "How many people are going?",
            "There will be three of us.",
            "Do you have a ride preference like [ride_type] or [ride_type]?",
            "Regular should be fine. And change of plans, I need the cab for just 1 person.",
            "Finding a [ride_type] cab for [number_of_seats] to [destination]. Shall I proceed?",
            "Hold on. Can you find me a Pool ride?",
            "Okay. So, you would like a [ride_type] ride to [destination]. Right?",
            "Yes, that's correct. How long will it take for the cab to get here and how much will the ride cost?",
            "The cab has been booked and it is expected to arrive in [wait_time] minutes. The ride will cost [ride_fare].",
            "Thank you for the assistance.",
            "Is there anything else I can do for you?",
            "No. That'll be all for now.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time is the movie The Curse of La Llorona playing in Larkspur?",
            "What date are you interested in?",
            "I want to see the movie on the 3rd.",
            "There is [count] showing at [show_time] at [theater_name].",
            "Perfect.",
            "Do you want to purchase tickets for the movie?",
            "No, but I do need a cab to get there.",
            "OK, please confirm the address you will be going to is [destination]. How many people do you need a reservation for and would you like a [ride_type], [ride_type], or other type of ride?",
            "The address is correct. I would like a luxury ride for one person.",
            "Please confirm you would like to reserve a luxury ride for [number_of_seats] people to [destination].",
            "Yes, perfect.",
            "Your cab has been booked and is on it's way.",
            "Thanks so much.",
            "Can I do anything else for you right now?",
            "No, thanks.",
            "Enjoy the show!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time will it be on?",
            "Is there a date you want to see it?",
            "Yes, I would like to watch it on the 1st of this month.",
            "Can you give me the name of the movie you want to watch and your location?",
            "I would like to see The Curse of La Llorona in Newark please.",
            "I found [count] showing at [show_time] at the [theater_name].",
            "That sounds great! I would like a Luxury cab ride to 400 Newpark Mall.",
            "And how many are in your group?",
            "There is only 1 in my group.",
            "Please confirm that you would like a [ride_type] ride to [destination] for [number_of_seats] person.",
            "Yes, that will be perfect. Can you tell me what the price is and when the cab will arrive?",
            "I have booked your cab and it will be here in [wait_time] minutes. It will cost [ride_fare].",
            "Thank you, that is all I need for now.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hello, I am looking for a movie to watch.",
            "Hello! I can help you with that. What movie are you interested in seeing and where are you located?",
            "I would like to see the movie Little. I am located in Pittsburg.",
            "What day would you like to see it on?",
            "Preferably the 1st. Are there any showings at the Maya Pittsburg Cinemas?",
            "There is one show at [show_time] at the [theater_name].",
            "That sounds good. Can you help me book a cab there?",
            "Yes, I can help you with that. What type of ride would you prefer? There is pool, luxury, and other options. Also, how many are there in your group?",
            "I would prefer a luxury ride. There are two people in my group.",
            "The address [destination], correct?",
            "Yes, that is correct.",
            "Please confirm: You would like a luxury cab ride to [destination]. There are [number_of_seats] people in your group.",
            "Actually, can I book a ride to 1599 Hopkins Street? There is only one in my group now.",
            "Please confirm changes: There is [number_of_seats] person in your group and the destination is [destination].",
            "Yes, that is correct. How long will it take for the cab to get here and how much will it cost me?",
            "I have booked your ride and it is on its way to your location. They will be there in approximately [wait_time] minutes and you will be charged [ride_fare].",
            "Thank you so much for your help today. That will be all.",
            "Have a wonderful time!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you tell me the time when I can watch the movie?",
            "Could you please tell me what movie do you want to watch?",
            "I would like to watch Teen Spirit.",
            "Can you tell me your preferred date for when you want to watch the movie? Which is the location you want for the movie to be shown?",
            "I want for movie to be shown in San Ramon, and the show to be tomorrow.",
            "I can see that there is a show of your requested movie at [show_time] at [theater_name].",
            "Seems nice. I am in need of a cab to go there.",
            "Can you tell me the number of the seats you need for the cab? Will you be going to [destination]? Is there a specific type of ride you want? It can be a [ride_type], [ride_type] or some other kind of ride.",
            "That suits me well. I want to have a Pool ride for one person.",
            "Can you please confirm that you want to have a [ride_type] ride for [number_of_seats] person to go to [destination]?",
            "That's right, that's what I want.",
            "Your requested cab has been booked, and is already on the way.",
            "I appreciate your help very much. That would be all.",
            "Enjoy your day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time can I watch a movie?",
            "What location and movie?",
            "I want to check out Shazam in Walnut Creek.",
            "On what date?",
            "I want to watch it today.",
            "I found [count] showing of Shazam at [theater_name], at [show_time].",
            "Nice. Can you fetch a cab for me?",
            "Sure. Is your destination [destination]?",
            "That is correct.",
            "Do you want a pool ride, luxury ride, or something else? How many seats?",
            "A luxury ride for two is good.",
            "Okay, you want a [number_of_seats] seat luxury ride to [destination]?",
            "Correct. What's the price, and how long will I have to wait?",
            "The cab is headed your way. It will cost [ride_fare], and should arrive in [wait_time] minutes.",
            "Thanks for helping me out.",
            "Can I help you out any further?",
            "Nope. Thanks for the help.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time can I watch it?",
            "In which city are you planning to watch it and on what date?",
            "I'm in San Ramon and want to watch it on Tuesday next week.",
            "Do you have a specific movie in mind?",
            "Yes. I want to watch Shazam!",
            "There is a show at [show_time] in [theater_name].",
            "Sounds good. Can you help me to get a ride there?",
            "How many of you are travelling and do you have any ride preferences? Please confirm that you are going to [destination].",
            "Yes, you got the address right and the cab is for just one person and I'd like some Luxury please.",
            "Please confirm that you want a [ride_type] cab for [number_of_seats] to [destination].",
            "Yes, that's correct.",
            "The cab has been booked and it is on its way.",
            "Thank you for the assistance.",
            "Is there anything else I can do for you?",
            "No. That's all I need for now.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a 3d show at the Roxie Theater. What time can I watch there?",
            "Which movie would you like to watch?",
            "I want to watch Penguin Highway.",
            "On what date would you like to watch it? What is your location?",
            "I want to watch it this Saturday. Could you search for movies being shown in San Fran.",
            "There is [count] showtime available for the movie. It is at [show_time] in [theater_name].",
            "Sounds good to me.",
            "Would you like to buy tickets?",
            "No, don't purchase tickets now.",
            "May I help with anything else?",
            "Can you get a cab to get me there?",
            "Do you have a preferred type of ride? Will you be going to [destination]? How many seats do you need?",
            "I would like a Luxury ride for a group of 1. This will work for me.",
            "Please confirm these details: You want a [ride_type] ride for [number_of_seats] to go to [destination].",
            "No, I would like a Regular ride.",
            "Please confirm these details: You prefer a [ride_type] ride to [destination].",
            "No, I want a ride to 15055 Los Gatos Boulevard.",
            "Please confirm these details: You want a ride for [number_of_seats] to [destination].",
            "Yes that works fine.",
            "I have booked your ride and the cab is on the way.",
            "How much will it cost and how long until the cab gets here?",
            "The ride will cost [ride_fare] and the cab will take [wait_time] minutes.",
            "Thank you very much for the help. That is all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a movie next Tuesday at Livermore Cinema.",
            "What movie do you want?",
            "I want to see Captain Marvel.",
            "What is the city?",
            "I want to find movies in Livermore.",
            "I found [count] show at [show_time] at [theater_name].",
            "What is the address?",
            "The address is [street_address].",
            "I need a cab to get there.",
            "Do you want [ride_type] or [ride_type]?",
            "I want a luxury ride.",
            "How many seats you want?",
            "I just need 1.",
            "Confirm [number_of_seats] luxury seat for a ride to [destination].",
            "Yes I confirm all.",
            "Your cab is on the way.",
            "That is all I need.",
            "Have a great time."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch a movie at?",
            "What is your current location? What is your preferred date?",
            "I need movies in Cloverdale for this Saturday.",
            "Which movie would you like to see?",
            "I want Hellboy.",
            "There is [count] showtime which matches your selection. There is one show at [show_time] in [theater_name].",
            "OK, that sounds good. Can you find me a cab?",
            "Will you be going to [destination]. Which ride would you like to choose? You may take [ride_type], [ride_type] or anything else. How many seats would you like?",
            "OK, sounds good, and I need a regular ride for 2 people.",
            "Please confirm the following information: You would like a ride to [destination] and need [number_of_seats] seats. You would prefer a [ride_type] ride.",
            "Yeah, that works. How long will the cab take?",
            "The cab is now en route to your location and expected arrival time is in [wait_time] minutes.",
            "Thank you for that!",
            "Of course. Have a wonderful day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I see a movie?",
            "What film would you like to see?",
            "I'd like to see Captain Marvel.",
            "Where are you?",
            "I'd like to see movies in San Jose.",
            "What is the date that you'd like me to search?",
            "The 6th of March would be perfect.",
            "There's a show at [theater_name]. It's at [show_time].",
            "Is it playing another time? I want to watch a regular showing.",
            "There's [count] other showtime. It's at [show_time] at [theater_name].",
            "What type of movie is it? And how much does it cost?",
            "Tickets are [price] per person, and it's an [genre] film.",
            "That sounds great. Can you get me a cab too?",
            "What type of ride? [ride_type]? [ride_type]? Something else?",
            "I'd like a Luxury ride.",
            "How many seats will you be needing?",
            "My group will have 2 people.",
            "Will you be arriving at [destination]?",
            "Yes, that'll be great.",
            "Please confirm: You'll need [number_of_seats] [ride_type] seats on a ride to [destination].",
            "Yes, that's perfect.",
            "I've booked you a ride. The cab is on the way.",
            "Thank you very much!",
            "Anything else I can help you with?",
            "Nope, that'll be it. Thank you.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Is Little on 2nd of March?",
            "Your location?",
            "Redwood City.",
            "I found [count] showetime at [show_time] in [theater_name].",
            "Ticket price? Address?",
            "[price] per person at [street_address].",
            "Great. Reserve a cab for me to get there.",
            "How many seats? You prefer [ride_type] or [ride_type] or something else?",
            "One in Pool.",
            "Please confirm [number_of_seats] [ride_type] ride to [destination].",
            "That's fine. How much?",
            "Reservation is successful for [ride_fare].",
            "Thanks. That's all.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'm in the mood to watch a movie. What are the available showtimes?",
            "Do you have a specific movie and a date in mind?",
            "I want to watch Breakthrough next Thursday.",
            "Where are you located?",
            "I am located in Oakland.",
            "I found the movie playing at the [theater_name] at [show_time].",
            "Can you provide my with the location of the theater as well as the cost for the ticket?",
            "The price of the one tickets [price] and you can find the theater at [street_address].",
            "Great. Can you also book me a Regular cab ride for a group of three.",
            "You would like a [ride_type] ride for [number_of_seats] to the destination [destination]. Is that correct?",
            "Perfect. How long of a wait do I have for the cab to arrive? Can you provide me with the final cost.",
            "The cab should arrive in about [wait_time] minutes and the cost will be [ride_fare].",
            "That is everything, thank you for all your help.",
            "It was my pleasure, have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When is it playing?",
            "Depends on the date and location.",
            "How about on the 3rd of March in Santa Clara?",
            "Which movie are you talking about?",
            "Missing link.",
            "There is [count] showtime for [show_time] at [theater_name].",
            "Where is that theatre at? What genre is the film?",
            "Go to [street_address]. Its a [genre].",
            "Can you get me a luxury ride for two there?",
            "Sure. [number_of_seats] to [destination]. [ride_type] car. Correct?",
            "Nada. Make it a Pool ride instead.",
            "[number_of_seats] for a [ride_type] ride?",
            "Yes, thats right.",
            "The cab is on the way.",
            "Great. I am good to go.",
            "Take care then."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a movie and I need your help to search for the interested one.",
            "Do you prefer any location to watch the movie?",
            "Yes, Search for the one show in Daly City at Century Daly City.",
            "Do you have any particular movie to search? and in which date you like to watch the movie?",
            "I like the movie Hotel Mumbai and please check for the available show times for this move on the 2nd.",
            "Found on show time at [show_time] in [theater_name].",
            "That is nice. Thanks.",
            "Do you want to buy the tickets now? Shall I proceed?",
            "No, not now.",
            "Anything else you need from me to do?",
            "Yes, I want to book a Cab to go there.",
            "For How many persons and confirm your end place at [destination].",
            "Address is correct and make it for 1 person.",
            "Is there any specific type of ride you like [ride_type] or [ride_type] or anything else?",
            "Yes, Luxury will be perfect for met. Book the cab with Luxury ride.",
            "Need your final confirmation to book a Cab with [ride_type] ride for [number_of_seats] person to [destination].",
            "That is okay. Thanks. What is the cost and what will be the taken by the Cab to reach my place?.",
            "I have booked the Cab for which the ride cost is [ride_fare] and the same will reach you within [wait_time] minutes.",
            "Thank you for your help and that's all for now.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I would like to watch it on the 2nd, do you know what time it is showing?",
            "Where are you and what do you want to watch?",
            "The Curse of La Llorona in Newark.",
            "There is [count] availability on that day at [show_time] in [theater_name].",
            "Sounds exactly right.",
            "Do you want me to purchase tickets?",
            "No not right now but could you get me a regular ride cab there for one to 400 Newpark Mall.",
            "To confirm then that is a regular ride cab for [number_of_seats] to [destination].",
            "Yes that is correct.",
            "Your ride is booked and on the way now.",
            "That's all thanks.",
            "Have a lovely day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch it on the 2nd, what availability is there?",
            "What movie are you talking about?",
            "The movie Shazam!",
            "Where abouts are you?",
            "I am in Danville.",
            "There is [count] showing at [show_time] at [theater_name].",
            "Suits me.",
            "Will I purchase tickets?",
            "No not right now but can you organize me a cab?",
            "Which type of ride? The address is [destination]?",
            "Sounds good, and a regular ride please.",
            "How many passengers are travelling?",
            "Just one please.",
            "To confirm then that is a regular ride cab for [number_of_seats] to [destination].",
            "No I have changed my mind I would prefer a Luxury ride.",
            "To confirm then that is a [ride_type] ride for [number_of_seats].",
            "Yes that suits me.",
            "You booking is confirmed and on the way.",
            "How much will it be?",
            "It will be [ride_fare].",
            "Thanks for your help that is all for now.",
            "Enjoy the rest of your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time is it playing?",
            "Location, date and name of film?",
            "The Curse of La Llorona is at Union City next Wednesday.",
            "I found [count] showtime at [show_time] at [theater_name].",
            "Genre? What's the address?",
            "It's [genre] and at [street_address].",
            "Good.",
            "Do you want tickets?",
            "Not now. Get a cab to there.",
            "Number of seats?",
            "For 2 people.",
            "Type of ride?",
            "Luxury.",
            "Please confirm: luxury ride for [number_of_seats] to [destination].",
            "That works.",
            "Your ride is on its way.",
            "Thanks, that's everything.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you find out when Breakthrough is playing in Newark?",
            "For what day?",
            "The 7th of March.",
            "There's a [show_time] show at [theater_name].",
            "What will a ticket run me? Where is this place?",
            "[price]. [street_address].",
            "Sounds like a plan.",
            "So, should I pick up a ticket?",
            "No, don't do that.",
            "Should I do anything?",
            "Yesh, get me a taxi there. I got 3 people including myself. Make it a Pool ride if you can.",
            "[number_of_seats] seats on a [ride_type] ride to [destination]?",
            "You got it.",
            "The taxi is on the way.",
            "How long does it take to get there? And what will this set me back?",
            "Its an [wait_time] minute ride. It should be about [ride_fare].",
            "Thanks. Good job.",
            "Do you have any more jobs?",
            "No, I got everything I need.",
            "Great. Speak later."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'm looking for movie times.",
            "Ok, what movie do you want to see and on what date?",
            "I would like to see Captain Marvel on Friday next week.",
            "Ok, what city should I look in?",
            "I'm in Brentwood.",
            "That movie is playing at [show_time] at [theater_name].",
            "Can you tell me the theater's address please?",
            "Sure, it is [street_address].",
            "What is the price for a ticket and what type of movie is it?",
            "It is an [genre] movie and a ticket costs [price].",
            "Perfect! Can you get me a Luxury ride to go there?",
            "Yes, how many people will be traveling?",
            "Just one.",
            "You would like a [ride_type] ride for [number_of_seats] person to [destination]. Do I have the information correct?",
            "Yes, that's right. How much will the ride cost and how long will it take to get here?",
            "Your cab is on the way and should arrive in [wait_time] minutes. The fare is [ride_fare].",
            "Thanks so much!",
            "Do you need anything else?",
            "No, that's it.",
            "Great, have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'm in the mood to see somethign at Imax in Newark. What should I see?",
            "Do you have a preference of any sort? When are you free to go?",
            "I want Little. I can go on the 4th of this month.",
            "You'll need to get to the [theater_name] at [show_time]. That's the only choice.",
            "That's Ideal. thanks.",
            "How about pre purchasing tickets?",
            "No, that's gonna be a pass.",
            "What more might you need?",
            "Get me a cab to take me there.",
            "You're going to the imax at [destination] right?",
            "correct, I think that's right.",
            "What style ride? How many of you are there?",
            "Regular style is best and there are two of us.",
            "Here's what I have: [number_of_seats], going to [destination]. [ride_type] ride.",
            "Fine, what will the damages be on that? How long will it take the cab to make the trip?",
            "Your charge will be [ride_fare] and it only takes [wait_time] minutes.",
            "That's so quick, thanks.",
            "Do you need other accomodation?",
            "No, not at all.",
            "Enjoy the imax experience."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "what time can i watch it?",
            "what film do you want to watch and on what day?",
            "i'd like to watch wild nights with emily on the 8th.",
            "where are you?",
            "just look in sebastopol.",
            "there's a show at [theater_name] at [show_time].",
            "what's the price of a ticket? what genre is the film?",
            "it's a [genre] movie, and the tickets cost [price].",
            "that'll work, can you get me a cab for one person over there?",
            "you want a pool or regular ride to [destination]?",
            "a pool ride works fine.",
            "you want a pool ride for [number_of_seats] to [destination]?",
            "yes please, how much will it be?",
            "it's on the way and it'll cost you [ride_fare].",
            "how long until it's here?",
            "it should be there in [wait_time] minutes.",
            "thanks, that's everything.",
            "have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to see a movie. Can you find me showtimes?",
            "I'd love to help. Where are you located and what day will you be attending? Do you have a specific movie in mind?",
            "I'd like to see if there are any showtimes for Body Double in SFO on the 15th of this month.",
            "There is [count] showtime at [theater_name] at [show_time].",
            "Where is that located?",
            "It's located at [street_address].",
            "What genre is the movie and how much are tickets?",
            "It's a [genre] movie and tickets are [price].",
            "That will work. Can you find me a cab?",
            "How many are traveling in your party?",
            "There are 3 of us.",
            "Do you have a preference?",
            "I'd like a regular ride.",
            "You'd like a regular ride for [number_of_seats] to [destination]. Is this correct?",
            "Yes, that's right. Can you tell me how long until it gets here?",
            "[wait_time] minutes.",
            "How much is it?",
            "The total is [ride_fare]",
            "Thank you.",
            "You're welcome!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you look in for movies in Union City on March 3rd as i need to watch it on imax and what is the watching time?",
            "Which movie is your choice?",
            "I need to watch Little at AMC Bay Street and could you search for movies in Emeryville?",
            "There is one movie show in [theater_name] at [show_time]",
            "What is the movie type?",
            "It is a [genre] movie",
            "Perfect. Can you find a cab for me?",
            "Are you moving to [destination]? you need [ride_type] ride or [ride_type] ride?",
            "Perfect and i need a Regular ride",
            "What is the number of tickets you need?",
            "I need 1 ticket",
            "Please give confirmation details: You need a [ride_type] ride to [destination] and you require [number_of_seats] seat",
            "No, my choice is Luxury ride",
            "Please give confirmation details: You need a [ride_type] ride to [destination]",
            "Perfect and what is the cost?",
            "The ride price is [ride_fare].Booked your cab and will reach you shortly",
            "How much time it will take for cab reaching here?",
            "The cab will be there in [wait_time] minutes",
            "Thank you very much",
            "Have a nice day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch it at Opera Plaza?",
            "What is the name of the movie that you want to watch? Also, what date do you want to watch it?",
            "I want to watch Gloria Bell next Monday.",
            "Where are you located?",
            "Search in San Francisco.",
            "I found one showing at [show_time] at the [theater_name].",
            "Sounds good.",
            "Do you want to buy tickets?",
            "No, not now. Can you find me a cab there?",
            "Do you want a cab to [destination]?",
            "Yes, that is correct.",
            "What type of ride would you like? [ride_type], [ride_type], or something else? Also, how many seats do you need?",
            "I'd like a Regular ride for one.",
            "Please confirm that you desire a [number_of_seats] seat [ride_type] ride to [destination].",
            "Yes, that's right. How long will the cab be? How much will it be?",
            "I have booked your ride. The cab will arrive in [wait_time] minutes and will cost you [ride_fare].",
            "Thank you very much for your help.",
            "Is there anything else?",
            "No. Thank you.",
            "My pleasure. Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch a 3D show at Century Downtown?",
            "Where are you located and which movie would you like to see? On which date?",
            "I want to see Little in Pleasant Hill on Saturday this week.",
            "I found [count] at [show_time] in [theater_name].",
            "Sounds great!",
            "Would you like to purchase tickets now?",
            "No not right now.",
            "Can I do anything else for you?",
            "Yes, I need a cab there.",
            "To [destination], correct?",
            "Yes that is correct.",
            "How many seats? Do you have a type preference?",
            "A pool ride for three please.",
            "You need a pool ride for [number_of_seats] to [destination], correct?",
            "Yes that is correct.",
            "Your ride is on its way.",
            "When will it arrive?",
            "In [wait_time] minutes.",
            "Thanks, that's all I need.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Pull up 3d shows playing at SFO. I would like to watch at Century San Francisco Centre. I need a list of movies playing.",
            "What date we're you thinking?",
            "how about next Wednesday?",
            "Ok, what movie would you like to see?",
            "The Curse of La Llorona please.",
            "I was able to find [count] show time at [show_time] at [theater_name].",
            "What type of movie is this?",
            "This is a [genre] movie.",
            "Alright, I will need a cab there please.",
            "Is there a preference on your ride type? Will you be going to [destination]? Also, please tell me how many seats you will need to reserve?",
            "Let's splurge and do a Luxury ride. It will just be 1 seat for me. The address is also correct.",
            "Alright, let's confirm your reservation for [number_of_seats] seat on a [ride_type] ride going to [destination]. Is that right?",
            "Yeah that's right, How much is the ride going to be?",
            "Your ride is confirmed and in route. The cost will be [ride_fare].",
            "Great, How long before it arrives?",
            "Your expected wait time is [wait_time] minutes.",
            "Thanks for that.",
            "No problem. can I help with anything else at this time?",
            "Nope, that will be all.",
            "Ok, great. Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch it?",
            "Which movie would you like to watch and where are you located? What date would you like to watch it on?",
            "I'd like to watch The Best of Enemies in the Mill Valley area on March 1st.",
            "There is a showing at [show_time] in [theater_name].",
            "What genre is the movie?",
            "It is a [genre].",
            "Great. I'd like to order a cab for four people.",
            "Is there a particular type of ride you are looking for? Is the address for your destination [destination]?",
            "Yes that's great. I'd just like a Regular ride please.",
            "Okay s to confirm: You would like a [ride_type] cab for [number_of_seats] people to [destination].",
            "Prefect.",
            "Your cab has been booked and will be with you soon.",
            "Thanks for your help.",
            "Do you need anything else?",
            "No thanks",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch it?",
            "What is your location and on what date would you like to watch it on?",
            "Find me movies that are showing in Napa. I would prefer to watch it today.",
            "What movie would you like to watch?",
            "A regular show would be good. I want to watch Captain Marvel.",
            "There is one show available at [show_time] at the [theater_name].",
            "Is the movie playing at other times?",
            "Sorry, there are no other show times for this movie. Can I help with anything else?",
            "Can you look again? Can you search for movies being shown in Mountain View. I want to watch Dumbo preferably at Century Cinema.",
            "I found [count] showtime for the movie at [show_time] at the [theater_name].",
            "What is the address of this theater?",
            "The address is [street_address].",
            "What sort of movie is it?",
            "It is a [genre] movie.",
            "Sounds good. Can you find me a cab to get there for a group of four people?",
            "Do you have any preferred type of ride?",
            "A Regular ride will be good.",
            "Please confirm these details: You want a [ride_type] ride for [number_of_seats] people to ride to [destination].",
            "Yes, that works.",
            "I have booked the ride and the cab is on the way.",
            "Thank you very much for the help. That is all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Whats the time?",
            "which movie? and the location?",
            "I wanted to watch the Pet Sematary at century cinemas, please search in San leandro",
            "What date?",
            "On the 3rd",
            "At [theater_name] there is a [show_time] show",
            "Whats the address of it and what genre of it?",
            "Its a [genre] and the address is [street_address]",
            "thats good",
            "should i but the tickets?",
            "no, not now",
            "any thing else?",
            "Get me regular cab to there",
            "for how many seats?",
            "for two people",
            "please confirm: Book a regular cab to [destination] for [number_of_seats] people.",
            "Yes thats right. Whats the cost and the eta?",
            "Its on the way. cost is [ride_fare] and ETA is [wait_time] minutes",
            "thanks a lot",
            "any thing else?",
            "no, thats it",
            "have a good day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time is there a movie?",
            "Which movie would you prefer?",
            "I want to see Pet Sematary.",
            "What is your current location?",
            "Can you search for any movies shown in the city of Santa Rosa?",
            "Which date would you like to see it?",
            "I want to see it later today.",
            "There is a show at [show_time] in [theater_name].",
            "Okay, that time works for me but I need a cab.",
            "Do you have a preferred sort of ride? How many seats will you need?",
            "I need a luxury ride and am in a group of one.",
            "Would you like to go to [destination]?",
            "Yes, that is suitable for me.",
            "Please confirm the following information: You would like a ride to [destination], and would like [number_of_seats] seat. You would prefer a [ride_type] ride. Is this correct?",
            "Yeah, that sounds great.",
            "I have booked your ride and the cab is now on the way.",
            "Thank you for all that.",
            "Is there anything else that I may help you with?",
            "That was all I wanted and thanks a lot.",
            "Of course. Have a wonderful day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "If I want to watch a movie at Century Hilltop on 1st of this month, at what time can I watch it?",
            "Can you tell me where you would like to watch the movie?",
            "Find the shows of the movie in Richmond.",
            "Can you tell me the title of the movie you want to watch?",
            "I did read some good reviews about Pet Sematary, so I want to watch this movie.",
            "I can see that there is one show of the movie you requested at [show_time] in [theater_name].",
            "Seems nice. Is it possible to get me a cab so I can go there? I want to have a Pool ride. I would like to arrive to 3200 Klose Way.",
            "Which is the number of seats you need?",
            "I need to have three seats.",
            "Can you please confirm that you want to have [number_of_seats] seats for a [ride_type] ride to go to [destination]?",
            "That is what I want.",
            "The cab you requested has been booked, and is already on the way.",
            "Can you tell me how much it will cost me?",
            "The cab ride you want will cost you [ride_fare].",
            "Can you tell me how long will it take for the cab to arrive here?",
            "The cab should arrive at your location in about [wait_time] minutes.",
            "I appreciate your help very much. That would be all.",
            "Have a wonderful time."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "tell me the show timings",
            "I need your location",
            "Show me movies in San leandro",
            "Do you have movie and date specifications?",
            "Yes, i want to watch pet sematary on the 7th",
            "There is [count] show at [show_time] in [theater_name]",
            "can you tell me what kind of movie it is",
            "that is a [genre] movie",
            "tell me the theater's address and ticket cost",
            "The address is [street_address] and cost is [price] per person",
            "Okay, that works for me",
            "Is there anything else I can help you with",
            "Sure, book me a cab there",
            "Cab for how many people and what kind?",
            "A luxury ride for 1",
            "Booking a luxury ride for [number_of_seats] to [destination]",
            "Sounds perfect to me",
            "Booking successful. Your cab is on its way",
            "Thanks a ton. That would be all",
            "Have a great time!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Could you find for movies shown in Livermore and at what time can i watch it?",
            "What kind of movie you want to watch and on which date?",
            "I like to watch Missing Link on the 8th.",
            "There's one show in [theater_name] at [show_time].",
            "It is cool. Could you get me a cab there and i like regular ride to 2490 First street ina group of 4.",
            "Please give confirmation details: Your riding to [destination] with [number_of_seats] seats and a regular ride.",
            "That is okay for me. At what time the cab reaches here and what is the cost of the cab?",
            "I confirmed your ride and the cab is on its way. The cab reaches within [wait_time] minutes and the cost is [ride_fare]",
            "thank you very much for your help.",
            "Any other help you need?",
            "No, thank you so much for your help.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What times are Imax movies playing on the 9th?",
            "What movie and location are you interested in?",
            "I want to see Long Shot somewhere in San Jose.",
            "There is a [show_time] showing of that movie at [theater_name].",
            "Perfect!",
            "Do you need any further help?",
            "Yes, I need a taxi to get to the movie.",
            "I have the address as [destination], is that correct? Also, what type of ride you would like?",
            "I would like a Pool ride, and yes the address is correct.",
            "How many people will be needing a ride?",
            "Just one.",
            "You would like a [ride_type] ride for [number_of_seats] person to [destination], is that right?",
            "Yes. How long will it take for the cab to arrive and what is the price of the trip?",
            "Your cab is on the way and should arrive in [wait_time] minutes. The price is [ride_fare].",
            "Perfect! That's all I needed.",
            "Have fun!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I need to watch on 9th of March and what is the time to watch it?",
            "Which is the movies you are interested to watch?",
            "I like to watch Long Shot",
            "What is your address?",
            "Will you be able to look for movies in Santa Clara?",
            "i have got only [count] movie show time and that is at [show_time] in [theater_name]",
            "What is that movie type?",
            "Is the movie of [genre] type?",
            "Fine, can you book me a cab there?",
            "Will you go to [destination]?",
            "That is fine",
            "What number of seats you need?",
            "I am in group of three people",
            "You have any choice of type of ride?",
            "I need to have Luxury ride",
            "Please give confirmation details: You need [ride_type] ride to [destination] and your seat requirement is [number_of_seats]",
            "That is perfect",
            "Your ride is booked and cab will reach you soon",
            "Thank you very much",
            "Is there any other help from me?",
            "No, thank you",
            "Have a nice day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to go out to the movies, can you look for showings in San Ramon?",
            "When are you going? Do you fancy any particular movie?",
            "Yes, I want to see The Curse of La Llorona, on Wednesday next week.",
            "I found [count] showtime, at [show_time] in [theater_name].",
            "So what kind of movie is it?",
            "It's a [genre] movie.",
            "Where's the theater at? How much do I pay?",
            "The theater is at [street_address]. You'll pay [price] per person.",
            "Okay, can you book me a pool cab ride to get there?",
            "How many seats do you need?",
            "I need 2 seats.",
            "So I'll book you a cab to take [number_of_seats] in a pool ride, going to [destination], okay?",
            "That sounds right.",
            "The cab is booked, it's on it's way.",
            "Okay, thanks for that, I don't need for anything else right now.",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time is the movie playing?",
            "What movie are you talking about?",
            "The movie I want to see is Shazam.",
            "What day do you want to see it?",
            "I want to see Shazam later today.",
            "What city do you want to see it in?",
            "I want to see it in Los Gatos.",
            "Search found one show playing at [show_time] at [theater_name].",
            "That works for me.",
            "Shall I buy you tickets?",
            "No, not right now.",
            "Do you need something more?",
            "I need a ride for 1 person in order to get there.",
            "Is the address you are going to [destination]?",
            "Yes, it is.",
            "Do you want a [ride_type], [ride_type], or another type of ride?",
            "Book me a Luxury cab.",
            "You want a [ride_type] cab for [number_of_seats] person to [destination]. Is that right?",
            "No, get me a Pool ride to the Royal Botanic Gardens.",
            "You want a [ride_type] ride to the [destination]. Is that right?",
            "That is correct and can you tell me the price?",
            "Your cab is booked and is coming right now. The total bill for your ride is [ride_fare].",
            "How long do I have to wait for the cab?",
            "Your ride will be there in [wait_time] minutes.",
            "Thanks a lot.",
            "Do you need something more?",
            "No, that is all. Thanks.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time will I be able to watch it? Can you do a search for movies shown in SFO?",
            "What is the date you would like to watch it? What movie do you want to see?",
            "I would like to watch at Marina Theatre and I want to see Shazam. I would prefer to see it on 1st of this month.",
            "I was able to locate [count] showtime for the movie at [show_time] in [theater_name].",
            "That sounds fine.",
            "Is there anything else I can do for you?",
            "Yes, can you find me a cab there? I would like a luxury ride for a group of three going to 2149 Chestnut Street.",
            "Okay, confirm these details: You would like a luxury ride with [number_of_seats] seats going to [destination].",
            "No, I am only in a group of one.",
            "Please confirm these details: You would like a ride to [destination] and you are needing [number_of_seats] seat.",
            "Yes that is fine with me. What is the cost of it?",
            "I have finished booking your ride and the cab is headed your way. The price will be [ride_fare].",
            "How long will it take the cab to get here?",
            "The cab will get there in [wait_time] minutes.",
            "Thank you very much for your help.",
            "Is there anything else I can do for you?",
            "No. I appreciate the help.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch the movie?",
            "What movie do you want to see? Where and when do you want to watch it?",
            "I want to see Little later today in Santa Rosa.",
            "Search revealed [count] show at [show_time] at [theater_name].",
            "That works. I need a ride to get there.",
            "Do you prefer [ride_type], [ride_type], or another type of ride and how many people are going?",
            "I want a Regular taxi for 1 person.",
            "Is your destination address [destination]?",
            "Yes, that is right.",
            "You want a [ride_type] taxi for [number_of_seats] person to [destination]. Is that correct?",
            "That is right. Can you tell me the total cost?",
            "Your cab is booked and is on the way right now. The total cost is [ride_fare].",
            "Can you tell me how much time I have before the taxi gets here?",
            "It will be at your place in [wait_time] minutes.",
            "Thanks a lot. That is all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'm looking for Hellboy show times. Can you search in Santa Rosa?",
            "Is there a specific date you want to search for?",
            "Yeah, search for showings on the 3rd.",
            "There's a showing at [show_time] at [theater_name].",
            "Can you give me their address?",
            "They're located at [street_address].",
            "What genre is the movie? Also, what's the ticket price?",
            "Ticket prices are [price] for each person. And the genre is [genre].",
            "Okay, I'm cool with that.",
            "Would you like me to purchase tickets?",
            "No, don't buy tickets just yet.",
            "Is there anything else I can do for you?",
            "I need you to call a cab for me to get there.",
            "Would you prefer a certain type of cab such as [ride_type], [ride_type], or anything else? And how many passengers will there be??",
            "I'd like a Luxury cab for 1 passenger.",
            "I'll get you a [ride_type] cab for [number_of_seats] passenger to [destination], is that correct?",
            "Wait, hold on. It's actually for two passengers.",
            "I'll get you a [ride_type] cab for [number_of_seats] passengers, is that correct?",
            "Yeah, please book it.",
            "I've booked the cab and it's in transit now.",
            "When will the cab arrive, and what's the cost?",
            "The cab will arrive in [wait_time] minutes and the cost is [ride_fare].",
            "Thanks for all the help, that's it for now.",
            "Have a terrific day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hey! I am looking for a good movie to watch it on March 8th. Please can you find me one?",
            "Sure! What type of movie are you looking for? Where is your location?",
            "Is the movie Little available and I wish to watch it in Brentwood.",
            "Yup, there is [count] show time for the movie at [show_time] in [theater_name].",
            "What is its genre?",
            "[genre] movie, I think.",
            "sounds great.",
            "Do you wish to get tickets for this movie?",
            "Nope, not right now, might be later on.",
            "Do you need any other help?",
            "I'm looking for a Pool ride for 1 person to 2525 Sand Creek Road. Can you book a cab for me to get there?",
            "Okay! Please can you confirm me that you wish to have a [ride_type] ride to [destination] for [number_of_seats] person. Is that right?",
            "Yup, that would work.",
            "I've booked the ride and your cab is on the way.",
            "Thanks much for the booking",
            "Do you need any other assistance?",
            "Nope, thanks much for the help.",
            "Have a fantastic day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I would like to see a movie at the CineLux Almaden in San Jose. I would also like to know the movie times.",
            "What movie are you interested in seeing?",
            "Curse of La Llorona is of interest to me.",
            "What date do you wish to see the movie?",
            "The 3rd of March is when I would like to watch it.",
            "At [theater_name] the movie is playing [count] time at [show_time].",
            "What is the ticket price and what genre is the movie?",
            "This is a [genre] movie and it will cost [price] a person.",
            "That sounds good.",
            "Are you interested in purchasing tickets?",
            "Not at this time, however; I would like to take a regular cab there.",
            "How many seats should I request and is the address [destination]?",
            "Yes, it will be for 1 person.",
            "Please confirm a regular ride for [number_of_seats] person to [destination].",
            "Yes, that is right.",
            "Your booked ride is on the way!",
            "Thanks!! That is all I need at the moment.",
            "Enjoy the beautiful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time may I watch it?",
            "What movie do you wish to watch and where do you want to see the movie?",
            "I would like to see Dumbo in Daly city.",
            "On what date would you like to see it?",
            "I would like to see it on the 9th.",
            "At [theater_name] it is showing at [show_time].",
            "Please give me the address of the theater and the ticket cost.",
            "The cost is [price] and the theater is located at [street_address].",
            "Great. I would like to take a cab to this place.",
            "Would you prefer a ride that is luxury or pool or something else?",
            "My preference is a pool ride.",
            "What is the number of seats you need?",
            "There are three of us.",
            "Please confirm [number_of_seats] seats on a pool ride to [destination].",
            "Correct. What will be my cost and when will my cab arrive?",
            "Your booked cab will be here in [wait_time] minutes and the ride costs [ride_fare].",
            "Thank you for your help and I will not need further asisstance.",
            "Have a nice day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Find movie times at 3 Below Theaters and Lounge.",
            "For what movie and what date?",
            "I want to see Dogman next Tuesday.",
            "Sure, where are you located?",
            "It'll be in San Jose.",
            "There's a show at [show_time] at [theater_name].",
            "Sounds good to me.",
            "Should I get you tickets?",
            "No, I'll get them there. Can you get me a cab though?",
            "Sure, a pool or a regular?",
            "A pool is fine.",
            "How many seats?",
            "Just one, thanks.",
            "Will it be to [destination]?",
            "Yes, that's correct.",
            "Please confirm you'd like a pool for [number_of_seats] to [destination].",
            "Yes, perfect.",
            "Your cab is on its way.",
            "Thanks, that's all.",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to go and see a movie tomorrow, can you search for some options for me?",
            "Do you have a particular movie you want to watch?",
            "Watching Mary Magdalene at 3 Below Theaters and Lounge would be my preference.",
            "Where are you based?",
            "I'm in San Jose.",
            "I found [count] showtime, at [show_time] in [theater_name].",
            "I'm happy with that.",
            "Shall I buy tickets now?",
            "No, not yet.",
            "Anything else I can help you with?",
            "I'd like to book a cab to the theater.",
            "So do you want a pool ride, a regular ride, or something else?",
            "I'd actually quite fancy a Luxury ride.",
            "So do you want to go straight to [destination]? How many seats will you need?",
            "I'll go in a party of 2 to that address.",
            "So I'll book a [ride_type] ride for [number_of_seats] people going to [destination], okay?",
            "Actually, no, I want to go to Vaucluse House first.",
            "So I've amended the booking to take [number_of_seats] people to [destination], okay?",
            "Yes, that's fine.",
            "The cab has been booked.",
            "How long will it take to get here?",
            "It should arrive in [wait_time] minutes.",
            "Thanks a lot.",
            "Anything else I can help you with?",
            "No, thanks a lot for what you've done.",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch it next Wednesday, can you tell me the times it is showing?",
            "Where are you?",
            "In San Ramon.",
            "What movie are you talking about?",
            "It is called Breakthrough.",
            "There is a showing in [theater_name] at [show_time].",
            "What genre is the movie?",
            "It is deemed a [genre] movie.",
            "Sounds interesting.",
            "Would you like some tickets?",
            "No not at the minute.",
            "Do you need anymore assistance?",
            "I need a cab to get there.",
            "How many passengers are travelling there?",
            "There are 3.",
            "and you are going to [destination].",
            "Yes that is right.",
            "Which type of ride would you prefer?",
            "I Pool ride.",
            "To confirm then you need a [ride_type] ride cab for [number_of_seats] to [destination].",
            "Yes that is correct. How much and how long will it be to get here?",
            "It will be with you in around [wait_time] minutes and costs [ride_fare].",
            "Thanks for that, that is all.",
            "Have a lovely day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a movie in the Campbell located theater Pruneyard Cinemas next Wednesday.",
            "Any specific movie?",
            "Yes. The Curse of La Llorona.",
            "I found [count] showtime for that movie in [theater_name], specfically at [show_time].",
            "Good to know. Can you get a cab pool ride for 1 for me?",
            "Will you be going to [destination]?",
            "Yes, I am.",
            "Okay. You'll be taking a [number_of_seats] person pool ride to [destination]?",
            "Yes, that's right.",
            "I've booked your ride. The cab should be here soon.",
            "Thanks for helping me out there.",
            "Can I help you with anything further?",
            "Not at this moment. Thanks for getting the cab for me.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hi, what time can I watch a movie?",
            "Any preference on the location, date and specific type of movie you would like to watch?",
            "I would prefer watching Little in Fremont on the 8th of this month.",
            "There is [count] showtime for this movie at [show_time] in [theater_name].",
            "What type of movie is this?",
            "This is a [genre] movie.",
            "May I have their address please?",
            "They are located in [street_address].",
            "That sounds great!",
            "Could you help me purchase some tickets?",
            "No, could you help me book a pool ride first?",
            "Sure, how many seats do you need?",
            "I will be travelling in a group of 2.",
            "Please confirm your booking for [number_of_seats] seats on a [ride_type] ride to [destination].",
            "Sure, that is great.",
            "Your booking has been made and is on its way.",
            "Thank you for your assistance!",
            "No worries, do you need any further help?",
            "No thanks, that is all I need, thank you!",
            "Have a safe trip there!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Which is the correct time to watch it?",
            "What type of genre do you want to see?",
            "I wish to see Hellboy.",
            "Where are you located? In which date do you want to see the movie?",
            "Could you please find movies shown in Antioch. I wish to see it on next Monday.",
            "I searched and found [count] showtime for the movie. One show is at [show_time] in [theater_name].",
            "It is good.",
            "Shall I purchase tickets?",
            "No. It can be purchased later. Could you please help me in getting a cab there?",
            "How many seats shall I book?",
            "We are 3 persons.",
            "Which is your preferred type of ride? It may be [ride_type] or [ride_type] or anything else.",
            "I like a Regular ride.",
            "Are you want to go to [destination]?",
            "Yes. It is good form me. I am 1 among the group.",
            "Kindly ensure that, you need [number_of_seats] seat in [ride_type] ride to [destination].",
            "Yes. it is good for me. When will be the cab reach the starting place?",
            "The ride is booked and it is on its way. It will reach you in [wait_time] minutes.",
            "What is the cost of the ride?",
            "The riding cost is [ride_fare]",
            "Thank you so much for your help. That is what I want.",
            "Have a fantastic day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch?",
            "What movie? Where are you? What date?",
            "I want to watch Long Shot in Brentwood on the 10th of this month.",
            "I found [count] show at [show_time] at [theater_name].",
            "What is the genre?",
            "[genre].",
            "What is the address?",
            "[street_address].",
            "Cool, I also need a cab to get there.",
            "Is there a certain type of ride? For how many people?",
            "I need a luxury ride for 1 person.",
            "Please confirm, luxury ride for [number_of_seats] to [destination].",
            "Perfect. How much is the cost? How long before the cab is here?",
            "The cab is on the way. It will be [wait_time] minutes and the cost is [ride_fare].",
            "Thanks!",
            "Anything else?",
            "No, that is all.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Find me what time movies in Brentwood are available on the 2nd of March.",
            "What movie do you plan on seeing?",
            "I want to see Captain Marvel at Century Larkspur in Larkspur.",
            "Search revealed [count] result that is playing at [show_time] at [theater_name].",
            "That works. I need a Luxury cab for 1 to get there.",
            "Is the address you are going to [destination]?",
            "Yes, get me a Pool ride to go there.",
            "You want a [ride_type] ride for [number_of_seats] person to [destination]. Is that right?",
            "That is right. Can you tell me the total bill and when the taxi will be here to get me?",
            "The cab is on it's way, is expected to arrive in [wait_time] minutes and the total is [ride_fare].",
            "Thanks a bunch. That is all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I am intereseted in 3d movies in Sebastopol and the times they are showing.",
            "What date should I search?",
            "For March 9th please.",
            "What movie would you prefer?",
            "One called Wild Nights with Emily.",
            "There is [count] showing at [show_time] in [theater_name].",
            "What is the location of the theater?",
            "It is [street_address].",
            "How much will tickets cost?",
            "[price] per person.",
            "That is fine.",
            "Would you like me to purchase tickets?",
            "No not right now.",
            "Can I assist you with anything else?",
            "I need a cab to go there for one person.",
            "Which type of ride for example [ride_type] or [ride_type] or something else?",
            "I want a regular ride.",
            "To confirm then you want a regular ride cab for [number_of_seats] to [destination].",
            "Yes that is fine by me.",
            "Your booking is confirmed and you cab is on they way.",
            "That is all for now thanks for your help.",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hi, what time can I watch the movie?",
            "May I know your location, what kind of movie and when would you like to watch the movie?",
            "I would prefer to watch Red Joan at the Guild Theatre in Menlo Park on the 9th of March, thanks!",
            "Sure, there is [count] showtime for the movie at [show_time] at the [theater_name].",
            "May I know how much the ticket costs and what type of movie is this?",
            "This is a [genre] movie which will set you back at [price] per ticket.",
            "I see, could you reserve a taxi for me there?",
            "Sure, any preference on the type of ride?",
            "I would prefer a Luxury ride, it is more comfortable.",
            "How many seats do you need?",
            "I will be travelling in a group of 1.",
            "Will you be travelling to [destination]?",
            "Yes, that is fine with me.",
            "Please confirm your reservation for [number_of_seats] [ride_type] ride to [destination].",
            "Sure, this is perfect!",
            "Your reservation has been made and your taxi is currently on its way!",
            "Sure, how long does the cab take to reach me and how much does it cost?",
            "Your taxi will reach in [wait_time] minutes and cost you [ride_fare].",
            "Sure, that is all the help I need, thank you!",
            "No worries, have a great day ahead!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When is it playing?",
            "Depends where you want to watch it.",
            "Try Mountain View. See if Captain Marvel is playing there.",
            "When do you want to watch it.",
            "On the 5th.",
            "There is [count] showtime at [show_time] at [theater_name].",
            "How much is this? And what genre?",
            "Its an [genre] film. [price].",
            "Cool, but I need a taxi there.",
            "A luxury or [ride_type]? Is the address [destination]?",
            "That's correct. 1 person for a Pool ride.",
            "[number_of_seats] seat in a [ride_type] ride to [destination]?",
            "That is correct. When will the taxi be here?",
            "The car should be here in [wait_time] minutes.",
            "Whats the price tag?",
            "It will be [ride_fare].",
            "Excellent job. I think we are done here.",
            "Great. You take care now."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time am I able to watch?",
            "Which movie and what location and date do you wish to watch it?",
            "I would like to watch The Best of Enemies shown on Sebastopol later today.",
            "I have [count] showtime at [show_time] in [theater_name].",
            "Tell me the address of the theater.",
            "The theatre is located at [street_address].",
            "That sounds very good.",
            "Is there anything else I can assist with?",
            "Please get me a cab there.",
            "Is there a preferred type of ride?",
            "I would like a regular ride.",
            "What is the number of seats you need?",
            "I would be in a group of three.",
            "Please confirm a regular ride for [number_of_seats] seats to [destination].",
            "Yes, that will be good.",
            "I have booked the ride and the cab is coming.",
            "Thanks so much for the help.",
            "Is there anything else I can assist with?",
            "No thank you so much for the help.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What is a good time to see it?",
            "Can you give me your location and time that you want to see the movie? Tell me the movie that you would like to go watch.",
            "I would like to see Dumbo and prefer movies in Santa Clara. I want to go view it on March 1st.",
            "I was able to find [count] showtime for the movie at [show_time] in [theater_name].",
            "What is the price of the ticket?",
            "Each ticket cost [price].",
            "What is the movie genre? Can you give me the theater's address?",
            "The movie is a [genre] and the theater is located at [street_address].",
            "That sounds pretty appealing.",
            "Do you want me to purchase some tickets for you?",
            "Naw, I don't want to buy any at this time.",
            "Would you like help with something else?",
            "Can you grab a cab for me?",
            "What is your desired ride type and how many seats?",
            "I would ideally like a pool ride. There's only 1.",
            "Please verify the following specifics: You need [number_of_seats] seat for a pool ride that is going to [destination].",
            "Yep, that is correct.",
            "I have booked the cab and it's headed to you now.",
            "I thank you for all your help and that's it.",
            "Enjoy this beautiful day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to go watch a movie at Embarcadero Center Cinema in SFO. Find some showtimes for the 9th of this month.",
            "What movie you want to see?",
            "Search for Ash Is Purest White.",
            "There is [count] showtime at [show_time] in [theater_name].",
            "Where is it located?",
            "The address is [street_address].",
            "What type of movie is it?",
            "It is a [genre] movie.",
            "Sounds interesting. I need a cab to get there. I will go with a friend so please find a regular ride for two people.",
            "Please confirm: Getting a regular cab ride for [number_of_seats] people to go to [destination].",
            "That is correct.",
            "The cab is on its way.",
            "Thanks a lot.",
            "Is there anything else I can help you with?",
            "No, that would be all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hi, what time will I be able to watch it?",
            "Where are you located and what movie would you like to see?",
            "I want to see Curse of La LLorona in Mountain View.",
            "Okay, which date would you like to go?",
            "I want to see it March 2nd in imax.",
            "I found [count] showtime for you at [show_time] at [theater_name].",
            "That's great for me.",
            "Do you want to get tickets for it?",
            "No thanks, not right now.",
            "Can I help with anything more now?",
            "I need to get a cab there. I'd like a regular ride for 4 people to 1500 North Shoreline Boulevard.",
            "Okay, please confirm: regular cab with [number_of_seats] seats to [destination].",
            "Yep, that's perfect.",
            "The booking was successful and the cab is on the way.",
            "How much will the cab cost me? And how long before it gets here?",
            "The ride will be [ride_fare] and it will arrive in [wait_time] minutes.",
            "Thanks so much for helping.",
            "Can I help any other way?",
            "No, thanks so much.",
            "Have a great rest of the day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a movie.",
            "What movie and what day?",
            "I want to watch Hellboy on the 9th of this month in Union City.",
            "I have one at [show_time] at [theater_name].",
            "What is address and cost?",
            "Address is [street_address] and is [price].",
            "That is perfect for me.",
            "Do you want tickets?",
            "No hold off. I need a Luxury ride for 1.",
            "Confirm a [ride_type] ride for [number_of_seats] to [destination].",
            "Yes, I confirm all.",
            "Your cab is on the way.",
            "How much is it?",
            "The ride is [ride_fare].",
            "That is all I need today.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'm looking to watch something, can you help me find show times?",
            "Is there a specific movie you have in mind, and where are you located?",
            "I'm interested in Dumbo, where is it playing in San Jose?",
            "What date are you interested in?",
            "I'd like to see it on Saturday this week. And is it at AMC Eastridge?",
            "There's [count] show time that matches. It's [show_time] at [theater_name].",
            "That works for me.",
            "Do you want to purchase tickets?",
            "No, I won't buy tickets right now. Can you book me a cab to get there?",
            "Do you have a cab preference such as [ride_type], [ride_type], or anything else? And the cab is to go to [destination]?",
            "Yeah, I'm headed there, and I want a Luxury cab.",
            "How many passengers will thee be?",
            "It's 3 in the group.",
            "I'll get you a luxury cab to [destination] for [number_of_seats] passengers, is this correct?",
            "Yeah, please get it. And what's the cost?",
            "The cost is [ride_fare]. The cab is booked and it's heading to your location.",
            "How long until it arrives here?",
            "It will be here in [wait_time] minutes.",
            "Thanks a lot for helping me.",
            "Do you need me to do anything else?",
            "No, thanks again for the help.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I need to watch it on the 4th and what is the time i need to watch it?",
            "Which is your choice of movie to watch?",
            "I need to see Hellboy",
            "Which place you are in?",
            "Can you look for movies shown in Antioch",
            "There is only one show in [theater_name] at [show_time]",
            "What is the ticket cost?",
            "Ticket costs [price] per person",
            "That is perfect",
            "You require tickets?",
            "No, i don't need now",
            "Is there any other help from me?",
            "I am in a group of 1 and need a pool ride to 4204 Lone Tree Way, can you look for a cab there?",
            "Please give confirmation details: You need a pool ride to [destination] and seat required is [number_of_seats]",
            "That is perfect and what is the ticket cost?",
            "The ride costs [ride_fare]. Your ride is booked and cab is on the way",
            "How much it takes to come here?",
            "Cab will be there in [wait_time] minutes",
            "Thank you very much",
            "Have a great day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When can I watch the movie?",
            "What date and location?",
            "1st of this month in Alameda.",
            "Any preference?",
            "Hellboy.",
            "I found [count] showtime at [show_time] in [theater_name].",
            "How much?",
            "[price] per person.",
            "Great. Will you reserve a cab there?",
            "[ride_type] or [ride_type] ride to [destination]? How many seats?",
            "Regular ride works for 1.",
            "Please confirm [number_of_seats] [ride_type] ride to [destination].",
            "That's fine.",
            "Your cab is on its way.",
            "When will it get here?",
            "In [wait_time] minutes.",
            "Thanks, that's all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What times are there to see it?",
            "Which movie do you want to watch, and at what location?",
            "I want to see Captain Marvel in Morgan Hill.",
            "On what date do you want to see it?",
            "I'd like to go on the 2nd of this month.",
            "I found one show at [theater_name] at [show_time].",
            "Are there any other times for that movie?",
            "Sorry, I'm not able to find any other showtimes for that movie. Do you need help with something else?",
            "Could you look for showtimes at CineLux Tennant Station for a different movie? I'd like to see Hellboy instead.",
            "I found [count] showtime for that movie. It is at [show_time] at [theater_name].",
            "Okay, that works for me.",
            "Is there anything else you need?",
            "Yeah, could you find me a cab to get there?",
            "How many people will be going?",
            "There will be 2 of us. I'd prefer a regular ride, and we are going to 750 Tennant Station.",
            "So you would like a regular ride for [number_of_seats] people to [destination], is that correct?",
            "Yes, that sound good to me.",
            "Your cab is booked and is on the way.",
            "Thanks for your help!",
            "Is there anything else you need?",
            "No, that's all I need right now, thank you.",
            "Alright, have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "My friend told me to go see this cool movie at imax. Your help setting that up for the 5th would be greatly appreciated.",
            "Sure. Wha't the name of the movie?",
            "It's called Wild Nights.",
            "And, what city do you want?",
            "Check out an imax in San Rafael, please.",
            "There is an [show_time] showing at the [theater_name].",
            "Okay, and what's the genre of the movie?",
            "The movie is a [genre].",
            "Nice one. Now, please order a cab for 1 person to go there.",
            "Do you want a [ride_type] or [ride_type] or some other type of ride?",
            "The Luxury ride is what I want.",
            "Your are going to the imax address at [destination], right?",
            "Yep, that's fine.",
            "Do you want to confirm a [ride_type] cab ride for [number_of_seats] passenger, going to [destination]?",
            "Yes, I'm ready to roll, and for how much, please?",
            "Your cab ride is confirmed for a total of [ride_fare], and should arrive shortly.",
            "That's so nice of you, and I thank you.",
            "Do you need more information?",
            "Nope, that's all folks. Appreciate that.",
            "Glad to help. Enjoy your movie."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I would like to wath a 3d show in Petaluma at Boulevard Cinema.",
            "What movie do you want to watch and on what day?",
            "I would like to go Tuesday next week and watch the Missing Link.",
            "I found [count] showtime for that movie at [show_time] in [theater_name].",
            "How much is the ticket and what is the address of the theater?",
            "The address is [street_address] and the cost is [price] per person.",
            "Thank you for the information.",
            "Would you like to purchase tickets?",
            "Not at the moment. Can you get me a cab to go there?",
            "How many seats and do you prefer a type of ride?",
            "I prefer a Luxury ride and it's for 1 person.",
            "[ride_type] ride for [number_of_seats] person to [destination].",
            "Thank you, what is the cost?",
            "The cost is [ride_fare]. The cab is on it's way.",
            "Thank you for your help.",
            "Can I help with anything else?",
            "No, that is all.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch The Best of Enemies on March 1st. What times can I see it at?",
            "Where are you located?",
            "I want to see it in Oakland.",
            "I found [count] showtime that matches your request. There is a showing at [show_time] at [theater_name].",
            "Where is that theater located?",
            "They are located at [street_address].",
            "What's the ticket price? What genre is the movie?",
            "The tickets are [price] per person, and the movie is a [genre].",
            "Okay, that sounds good.",
            "Would you like to purchase tickets for the movie now?",
            "No, not right now.",
            "Is there anything else I can help you with?",
            "Can you call a cab for me to go to the movie?",
            "Sure, do you prefer a type of ride?",
            "Yeah, I would prefer a regular ride.",
            "How many people will be going?",
            "Just 1 person is going.",
            "So you would like [number_of_seats] seat in a regular ride headed to [destination], is that correct?",
            "Yes, that sounds good.",
            "Your cab is booked and is on the way.",
            "Great, thanks for your help.",
            "Sure. Can I do anything else for you?",
            "No, that's all for now, thanks.",
            "Alright, have a nice day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hi, when can I watch a regular Hotel Mumbai show?",
            "Where and what date would you like to watch the movie at?",
            "Could you search for showtimes on Healdsburg on the 2nd please?",
            "Sure, there is currently [count] showtime for that movie at [show_time] in [theater_name].",
            "That sounds great!",
            "Would you like to purchase the tickets?",
            "No thanks, not now.",
            "Do you need any other help?",
            "Could you get me a cab ride there please?",
            "Sure thing. How many seats do you require and will you be travelling to [destination]?",
            "Yes, I will be travelling in a group of two.",
            "Any preference on the type of ride.",
            "I would prefer a Regular one please.",
            "Sure, please confirm your reservation for [number_of_seats] seats on a regular ride to [destination].",
            "That is fine. How much will this cost me?",
            "Your booking has been made and this will cost you [ride_fare].",
            "I see, thanks for your kind help!",
            "No worries, do you need any further assistance?",
            "No thanks, that is all I need.",
            "Sure, have a safe trip!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a 3d movie in San Leandro at the Century Cinemas. What do you recommend?",
            "Do you have an idea of the movie to watch? When do you want to watch it?",
            "I want to go see Pet Sematary on the 8th of March.",
            "There is [count] showtime for Pet Sematary at [show_time] in [theater_name].",
            "Where is the theater located? And do you know what type of movie it is?",
            "The address is [street_address] and it is a [genre] movie.",
            "Sounds great, I will need to get a cab to go there, find a pool ride for 1.",
            "Please confirm: Getting a pool ride cab for [number_of_seats] person to go to [destination].",
            "That is correct.",
            "The cab is on its way.",
            "Thanks a lot.",
            "Is there anything else I can help you with?",
            "No, that would be all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to watch a movie at Century at Hayward on 3rd of March. Can you help me find movies showing in Hayward? What times were available?",
            "What movie were you trying to watch?",
            "I'd like to watch Breakthrough. I'm looking for a regular show.",
            "I found [count] showtime for you. One showing is at [show_time] in [theater_name].",
            "That sounds good to me. Can you help me find a cab there?",
            "How many seats were you looking for?",
            "I'd like to find a cab for 3.",
            "Did you have a preference for the type of ride? You can take [ride_type], [ride_type], or anything else. Were you trying to get to [destination]?",
            "Yes, that sounds right. I'd like a Regular ride.",
            "Please confirm you want [number_of_seats] seats in a [ride_type] ride to [destination].",
            "Yes, that sounds good. How much does the ride cost and when will it arrive?",
            "Your ride has been booked and it is on its way. The cab should be here in [wait_time] minutes and will be [ride_fare].",
            "Thank you for your help.",
            "Did you need help with anything else?",
            "No, but thank you again.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I am in the mood to watch anything.",
            "Where are you located?",
            "I want you to look for movies in Alameda.",
            "Which movie would you like to watch and when?",
            "I want to see dumbo on the 5th of this month.",
            "There is [count] show at [show_time] at [theater_name].",
            "How much does the ticket cost?",
            "It is [price] a piece.",
            "That sounds great. I would need a cab to get there.",
            "What kind of ride? Would you be going to [destination]?",
            "A regular ride would do it for me.",
            "How many seats?",
            "Just 1. Myself.",
            "You would like a regular ride for [number_of_seats] to [destination]?",
            "That's about it.",
            "The cab would arrive shortly.",
            "Thank you. I need nothing else.",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time is it on?",
            "Where are you and on what date are you interested?",
            "In Fremont on 6th of this month.",
            "What movie are you interested in?",
            "A film called Shazam.",
            "There is [count] showing in [theater_name] at [show_time].",
            "Yes all good. I need a cab to 43917 Pacific Commons Boulevard.",
            "How many passengers are travelling with you?",
            "There will be three.",
            "Which type of ride do you want?",
            "A regular ride would be preferred.",
            "To confirm then you want a regular ride cab for [number_of_seats] to [destination].",
            "Yes that is correct.",
            "It is booked and on the way.",
            "Thanks that is everything for now.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to watch at United Artists Stonestown Twin: what time can I watch it?",
            "Which movie would you like? When do you want to watch the movie? In which city?",
            "I'd like The Aftermath, in SFO. I want to go on this Saturday",
            "There is [count] showtimes available: [show_time] in [theater_name]",
            "It's fine for me!",
            "Do you want a ticket?",
            "Not now, thanks",
            "Do you need anything else?",
            "I need a cab to go there",
            "What type of ride to go to [destination]? How many seats?",
            "I want a Luxury ride, for 4 people",
            "[number_of_seats] seats in a [ride_type] ride to [destination]",
            "No, I want to go to 42010 Blacow Road",
            "[number_of_seats] seats in a ride to [destination]. Is it correct?",
            "No, for 3 people",
            "[number_of_seats] seats in a [ride_type] ride. Is it correct?",
            "Yes, It's correct, thanks. How much is the ride?",
            "It costs [ride_fare]. Your cab is coming!",
            "Thanks so much for helping",
            "Do you need anything else?",
            "No, thanks. It's all",
            "Have a great day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I need to find movie times.",
            "OK, when and where would you like to watch the movie, and what movie did yu have in mind?",
            "I would like the see Dumbo somewhere in San Francisco on Sunday this week.",
            "There is [count] showing at [show_time] at [theater_name].",
            "What type of movie is Dumbo?",
            "Its considered a [genre] film.",
            "Can you give me the theather's address and ticker prices?",
            "The theater is located at [street_address] and charges [price] per ticket.",
            "Great, thanks.",
            "Do you want to purchase tickets for the movie?",
            "No, not right now.",
            "Ok, what else can I help you with?",
            "I need a cab for two people to get to the movie.",
            "Sure, what type of ride would you like?",
            "I just want a regular ride and actually need it for only one person.",
            "Please confirm you would like to book a regular ride for [number_of_seats] person to [destination].",
            "Yes, that's right.",
            "Your cab has been successfully booked and is on its way.",
            "Great, thanks so much!",
            "Is there anything else you need?",
            "Nothing further, thanks.",
            "Have a nice time!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Tell me when I can watch it.",
            "What date and movie are you referring to?",
            "I want to watch teen spirit on 2nd of march",
            "Where are you searching for?",
            "I want movies in San Bruno",
            "I found [count] showtime for this movie at [show_time] in [theater_name]",
            "What is the movie genre?",
            "It is a [genre]",
            "tell me the address.",
            "The theatre is located at [street_address]",
            "Sounds perfect to me",
            "Should I book the tickets?",
            "No, I will do that later.",
            "Is there anything else I can help you with?",
            "Sure, get me a pool ride for one person",
            "Sure, booking a pool ride for [number_of_seats] to [destination]",
            "Cool, that sounds perfect.",
            "Your ride is on it way",
            "Thanks a ton.",
            "Is there anything else I can help you with?",
            "No, that would be all",
            "Have a fantastic day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a movie in Larkspur.",
            "What movie? What day?",
            "I was to see the 3d show of Transit on the 5th of this month.",
            "There is one show at [show_time] at [theater_name].",
            "What kind of movie is it?",
            "[genre].",
            "Sounds cool.",
            "Anything else?",
            "I need a cab to get there.",
            "What type? A pool ride? Or a luxury ride?",
            "I need a luxury ride for two.",
            "Are you going to [destination]?",
            "Yes!",
            "Please confirm, [number_of_seats] seats in a luxury vehicle to [destination].",
            "Yes, that is correct. When will the cab arrive? What is the cost?",
            "The cab will be here in [wait_time] minutes. The cost of the ride is [ride_fare].",
            "Thanks, that is all.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to see Breakthrough on march 8th. What time is it showing?",
            "Where are you located?",
            "I want to see it in the lot city center in san ramon.",
            "There is a show at [show_time] in [theater_name].",
            "That sounds great.",
            "Would you like tickets to see the movie?",
            "No, not yet.",
            "Is there anything else you need help with?",
            "I want a luxury ride for three to 6000 bollinger canyon road suite 2300.",
            "You want a luxury ride for [number_of_seats] to [destination].",
            "Yes. When would the ride reach here?",
            "It should arrive in [wait_time] minutes.",
            "Thanks a lot. That would be all.",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to watch a regular show in Santa Rosa on the 8th. What time can I watch it?",
            "What movie do you want to watch?",
            "I want to watch Hellboy.",
            "Okay, I found [count] showtime for Hellboy. How about a showing at [show_time] at the [theater_name]?",
            "Where is that theater?",
            "It's at [street_address].",
            "Nice, what genre is it, and how much does it cost?",
            "It's just [price] for a ticket, it's a [genre] movie.",
            "Nice, thanks a lot.",
            "Should I book your tickets?",
            "Nah, not right now.",
            "Is there anything else?",
            "Can you get me a cab there?",
            "Sure, how many people are going?",
            "Just 1, I want a regular fare.",
            "Okay, please confirm that you'd like a regular fare for [number_of_seats] to [destination].",
            "That sounds good. How long until it gets here? How much will it be?",
            "It's on the way, it'll be there in [wait_time] minutes. It'll cost [ride_fare] total.",
            "Thanks so much.",
            "No worries, is there anything else?",
            "Nope, that's all.",
            "Okay, see you."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch it?",
            "What movie are you looking to watch, what is the location, and what date do you want to watch?",
            "I want to watch hellboy on the 5th in Santa Rosa.",
            "There's [count] showtime. It's at [show_time] in [theater_name].",
            "What's the address there?",
            "The address is [street_address].",
            "Sounds good, could you get me a cab there?",
            "Sure, how many seats, and would you prefer a luxury, regular, or something else.",
            "I need a regular ride for 1.",
            "Please confirm: You need a regular ride for [number_of_seats] to [destination].",
            "Actually, I need a pool ride for three.",
            "Please confirm: You need [number_of_seats] seats in a pool ride.",
            "Exactly, what's the cost?",
            "The ride is coming. Its cost is [ride_fare].",
            "Thank you for your help.",
            "Do you need anything else?",
            "No, thank you for your help.",
            "have a wonderful day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What are the current showtimes?",
            "On which day would you like to see it?",
            "I would like to watch it on the 5th of March and a 3d show preferably",
            "And do you know the name of the film that you would like to see?",
            "I would like to see Hellboy",
            "And where should I look for movie theaters?",
            "I am looking for locations in Antioch",
            "There is a [show_time] showtime for this movie at [theater_name]",
            "Can you tell me what type of movie it is and the exact location of the cinema?",
            "The movie theater is located at [street_address] and the movie is categorized as [genre]",
            "Excellent, that's great!",
            "Are you interested in getting tickets to this movie?",
            "Not right this second, thanks. I would like to reserve a taxi to take me there, please",
            "And do you have a particular kind of ride you would like? Also, how many seats do you require?",
            "I would like a Regular type of car for one",
            "So to confirm, you would like to book [number_of_seats] seat in a [ride_type] taxi cab to get to your destination at [destination].",
            "Yes, that's perfect. And what is the total fare and when will the cab get to my location?",
            "You cab has been confirmed. The total fare for your trip is [ride_fare] and the taxi will be arriving in [wait_time] minutes.",
            "Great. Thanks! That's it for me",
            "Have a lovely day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you tell me what time I can watch it?",
            "Sure, what date will you watch it on?",
            "It'll be on the 8th.",
            "Okay, and what do you want to watch? And where?",
            "I'd like to watch Captain Marvel in Petaluma.",
            "Oh okay, I found [count] showtime for it. It starts at [show_time] at [theater_name].",
            "Thanks, what genre is it?",
            "It's an [genre] superhero movie.",
            "How much is a ticket? And where is the cinema?",
            "It'at [price] per person, at [street_address].",
            "Thanks. Can you get me a cab there?",
            "Sure, how many seats in what kind of cab?",
            "I'd like a luxury cab for two.",
            "Okay, please confirm that you'd like a luxury cab for [number_of_seats] to [destination].",
            "Yes, that's correct.",
            "Okay, it's on the way.",
            "Thanks, how much will it be?",
            "It'll be [ride_fare].",
            "Thanks so much.",
            "Is there anything else?",
            "No, that's all thanks.",
            "Okay, see you."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When can I watch it?",
            "What movie do you want to watch, and on what date?",
            "I was to see Hotel Mumbai on the 2nd of this month.",
            "Where are you located?",
            "Look for movies in Healdsburg.",
            "There is a show time at [show_time] at the [theater_name].",
            "What's the cost of the ticket?",
            "It is [price] per person.",
            "Ok, that sounds good. I need a cab to get there. A shared ride is fine. I need to get to 415 Center Street.",
            "How many people will there be?",
            "It's just for one person.",
            "So you need a cab for [number_of_riders] person to [destination], and are fine with a shared ride, is that correct?",
            "Yeah that's great. How much will it be?",
            "I've booked your ride and it's on the way. The total cost is [ride_fare].",
            "Great, thank you.",
            "Is there anything else I can help you with?",
            "No, that is everything, thanks.",
            "Alright, have a nice day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I forgot I had plans to go to the movies tonight. What time is the movie playing again?",
            "What movie are you planning on watching?",
            "I am planning on seeing A Madea Family Funeral.",
            "And where at?",
            "Can you see where it's showing in San Jose?",
            "Sure, what day?",
            "I am planning on going later today.",
            "Ok, looks like it's showing at [show_time] in [theater_name].",
            "Great, that's perfect. Can you book me a cab there to 3630 Hillcap Avenue for 4 people? A shared ride is fine.",
            "Sure, to confirm, you want a shared cab for [number_of_riders] people to [destination]. Is that right?",
            "Yes, that's fine. What's the cost and ride time?",
            "I've booked your cab, it's on its way. It will be [ride_fare] for an [approximate_ride_duration] minute ride.",
            "Great, thanks. That's all for now.",
            "Sure, have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time is my movie playing?",
            "Which movie, where, and on what day?",
            "The movie Shazam playing in Redwood City on the 4th.",
            "There's a showing at [show_time] at [theater_name].",
            "Okay, sounds great.",
            "Should I get tickets for you?",
            "No, not right now. I'll get them there.",
            "Okay, need anything else?",
            "Yes, I need a cab to get to the theater.",
            "How many people and are you going to [destination]?",
            "Yes, and its for two.",
            "Is a shared ride okay?",
            "Yes, that's fine.",
            "Please confirm you'd like a shared ride for [number_of_riders] to [destination].",
            "Sure, how much is it and how long?",
            "Your car is on its way. It's [ride_fare] and will take about [approximate_ride_duration] minutes.",
            "Great, thanks again.",
            "Anything else I can do?",
            "Nope, that's it.",
            "Enjoy, have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch that?",
            "What is the location? Also what movie you like to watch on what date?",
            "Can you please search for Searching for Sugar Man show on 2nd of this month in San Francisco.",
            "There is [count] show at [show_time] in [theater_name].",
            "That sounds good.",
            "Would you like to book the tickets for the same?",
            "No. I don not want to make the purchase as of now. I want to book cab for 1 person to 3630 Balboa Street",
            "Please confirm the details: Shared cab required for [number_of_riders] person to [destination].",
            "Yes. That works fine.",
            "The ride has been booked and cab is on the way.",
            "Thanks a lot for assistance. That's all I needed at this point in time.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to watch an IMAX showing of Dumbo. What times were available?",
            "Where are you located?",
            "Can you help me find movies in Campbell?",
            "On what date did you want to watch the movie?",
            "I'd like to watch it on March 5th.",
            "I found [count] showtime. There is [count] showing at [show_time] at [theater_name].",
            "Where is the theatre located?",
            "The theatre is located at [street_address].",
            "That sounds good. I'd like to find a cab there.",
            "How many people were you getting the cab for and did you want a shared ride?",
            "The cab is for 1 person and I am fine with a shared ride.",
            "Please confirm you're booking a cab for [number_of_riders] to [destination] and you'd like a shared ride.",
            "Yes, that sounds good.",
            "Your ride has been confirmed and it is on its way.",
            "Thank you for your help.",
            "Did you need help with anything else?",
            "No, but thank you for your help again.",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I wanna see it on the 9th of this month",
            "what movie and where?",
            "Menlo park and Red Joan",
            "there is [count] showtime and at [show_time] in [theater_name]",
            "sounds very good",
            "are yo headed to [destination]?",
            "Yes I am",
            "want a shared ride there?",
            "I am fine with that",
            "How many people?",
            "one person just me",
            "confirm [destination] for [number_of_riders] person",
            "No it is for 2",
            "confirm [number_of_riders] people",
            "yes that works",
            "your ride is booked",
            "how much is it?",
            "it is [ride_fare]",
            "how long is it?",
            "It will be [approximate_ride_duration] minutes",
            "Thanks a lot",
            "anything else for you?",
            "No thank you",
            "Have a good one"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to a watch a regular showing of Ash Is Purest White. What times is it playing. And I want to watch it in SF.",
            "Is there a specific date you want me to search?",
            "Search for the 2nd of March.",
            "There [count] show time that matches. It's at [theater_name] at [show_time].",
            "Can you give me the theater address? And what's the genre of the movie?",
            "The address is [street_address] and it is in the [genre] genre.",
            "Okay,t hat works.",
            "Do you want me to buy you tickets?",
            "Now, don't get tickets right now. I do need a cab to get there.",
            "How many passengers will there be?",
            "It's just for one person.",
            "Is a shared ride okay?",
            "Yeah, shared ride is fine.",
            "I'll book you a shared ride cab for [number_of_riders] person to [destination], is that correct?",
            "Yes, that's what I want.",
            "I've booked the cab and it's on route.",
            "Thanks so much for the help.",
            "Would you like any further help?",
            "No, thanks again.",
            "Have a terrific day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch a movie.",
            "What movie would like to see and in what city?",
            "I want to see Captain MArvel someplace close to Alameda.",
            "What date would you like?",
            "I want to see it on the 9th of this month.",
            "I have [count] showing and it is for [show_time] in [theater_name].",
            "Wht is the cost of the ticket.",
            "Its [price] per ticket.",
            "Great I need a cab for two people to go there.",
            "Would you like a shared ride?",
            "Yea it is ok.",
            "You are going to [destination]?",
            "Yes that is correct.",
            "Just to confirm you want a shared cab for [number_of_riders] people going to [destination].",
            "Yes that is good. How long does it take to get there? how much is the fare?",
            "Your cab is on the way. It will take about [approximate_ride_duration] minutes with traffic and will cost [ride_fare].",
            "Thanks that will be all for now.",
            "Have a great night!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to watch a movie. Can you tell me what showtimes are available?",
            "I'd be happy to help. Where are you located and what day works best for you? Do you have a specific movie in mind?",
            "I'd like to see Hotel Mumbai in Union City later today.",
            "There is [count] available showtime. It is at [theater_name] at [show_time].",
            "Can you tell me where that is located?",
            "It is located at [street_address].",
            "What genre does that movie fall in? What do tickets cost at that theater?",
            "It's considered a [genre] and tickets cost [price].",
            "That works for me.",
            "Would you like to pre-purchase your ticket?",
            "No, I need to find transportation for 4 people to get there.",
            "Would you like a shared ride?",
            "That's fine with me.",
            "You'd like a shared ride for [number_of_riders] to [destination]. Is that correct?",
            "Yes. Can you tell me the expected duration of the ride and how much it costs?",
            "Your ride is on the way. It will be [ride_fare] and is expected to be [approximate_ride_duration] minutes long.",
            "Thank you for the assistance.",
            "Is there anything else I can do for you?",
            "No, that will be everything. Thank you.",
            "You are most welcome. Have a nice night!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time does the movie play?",
            "What is the name of the movie you want to see?",
            "I want to see Shazam in Morgan Hill on the 3rd of March.",
            "There is one showing and it is at the [theater_name] at [show_time].",
            "Is it available some other time? What about a regular show for Captain Marvel?",
            "One show is playing at [show_time] at the [theater_name].",
            "What movie genre is it?",
            "It is under the [genre] genre.",
            "That works for me. I need a shared cab to get to 750 Tennant Station.",
            "How many people are going?",
            "There are 2 people going.",
            "You want a shared cab for [number_of_riders] people to [destination]. Is that right?",
            "That is right. What is the ride duration and the total cost?",
            "The ride duration is [approximate_ride_duration] minutes, costs [ride_fare] and the cab is coming for you right now.",
            "Thanks a bunch.",
            "Do you need something more?",
            "No, that is all. Thanks.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to watch something at Presidio Theatre. What times were available?",
            "What movie did you want to watch, what day did you want to watch it on, and where are you located?",
            "Can you help me find movies in SF? I'd like to watch Hotel Mumbai and I'd like to watch it on the 1st.",
            "I found [count] showtime for you. There is a showing at [show_time] at [theater_name].",
            "What type of movie is it?",
            "The movie is a [genre] movie.",
            "Where is the theatre located and how much will the ticket be?",
            "It is at [street_address] and the price will be [price] a person.",
            "That sounds good.",
            "Did you want to buy tickets?",
            "No, I didn't want to buy tickets right now.",
            "Did you need help with anything else?",
            "I'd like to find a cab to get there.",
            "How many people did you need the cab for and did you want a shared ride?",
            "I am looking for a cab for 3 people and I'm fine with a shared ride.",
            "Please confirm you're getting a cab for [number_of_riders] people going to [destination] and you'd like a shared ride.",
            "Yes, that is correct.",
            "Your ride has been confirmed and is now on its way.",
            "How much will the ride be?",
            "The total cost is [ride_fare].",
            "Thank you for your help. That'll be all I need for now.",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to see an imax movie in Novato today.",
            "What movie?",
            "Captain Marvel.",
            "There is a single show at [show_time] at [theater_name].",
            "Sounds cool.",
            "Are you ready to buy tickets?",
            "No, not yet.",
            "Anything else?",
            "I want a cab to get there.",
            "Is the address [destination]?",
            "Yes. Its ok if it is a shared ride.",
            "How many people?",
            "2",
            "Please confirm, cab for [number_of_riders] to [destination].",
            "No, one to 7233 Healdsburg Avenue.",
            "Please confirm, cab for [number_of_riders] to [destination].",
            "Yes. How long will the ride be? What is the cost?",
            "Your cab is on the way. The ride will be about [approximate_ride_duration] minutes. The cost is [ride_fare].",
            "Thanks, that is all.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can see it?",
            "What is your current location?",
            "Look for films in Mountain View.",
            "What film do you want to see? On what day will you watch it?",
            "I want to watch Little on the 4th of March at Century Cinema.",
            "I found [count] showtime. It's playing at [show_time] in [theater_name].",
            "What's the address? Is it pricey?",
            "The price is [price] a ticket and the address is [street_address].",
            "Sounds great.",
            "Shall I buy tickets for you?",
            "No, not now.",
            "Can I help you with something else?",
            "I want a cab.",
            "Do want to share a ride? How many is it for.",
            "It's for two people. Yes, make it a shared ride.",
            "Please confirm the following details: You want a cab for [number_of_riders] and to go to [destination].",
            "No, just for 1. Becky bailed on me.",
            "Please confirm the following. A shared cab for [number_of_riders].",
            "Yes, that's good. How much is the cab and how long is the ride there?",
            "Your ride has been booked. The ride will be about [approximate_ride_duration] minutes and costs [ride_fare].",
            "Thanks for the help. That's all I wanted.",
            "Have a good day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Would you look for movies in San Jose from the 4th? I'd like to watch Breakthrough. What time can I watch?",
            "I have [count] showtime for this movie. There is one at [show_time] in [theater_name].",
            "That sounds good. I need a cab to get there.",
            "Would you like a shared ride? Would you like to go to [destination]? How many people do you need the cab for?",
            "That works. It should be for 2. I am fine with a shared ride.",
            "Would you confirm this: You are a party of [number_of_riders] and would like to go to [destination]. A shared ride is preferred.",
            "Yes, that works.",
            "Your ride has been booked. Your cab is coming.",
            "How much will it be?",
            "It will be [ride_fare].",
            "How long will the ride take?",
            "It should take about [approximate_ride_duration] minutes.",
            "Thank you for helping.",
            "Is there anything else I could help with?",
            "No, but thank you for helping.",
            "Have a good one!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time could I watch it?",
            "What movie are you looking to watch and on what date? Where are you located?",
            "Could you look for Captain Marvel in Morgan Hill for the 2nd of March?",
            "I have [count] showtime for the movie. There is one at [show_time] in [theater_name].",
            "That sounds great.",
            "Are you looking to buy tickets?",
            "Not at the moment. I need a cab to get there, though.",
            "So you want to go to [destination]?",
            "That sounds good.",
            "Would you like a shared ride? How many people would the cab be for?",
            "I am fine with a share ride and it's for 4 people.",
            "Could you confirm that you want a shared ride to go to [destination] and that you are a party of [number_of_riders]?",
            "Actually it is for two.",
            "Could you confirm that the cab is for [number_of_riders] and that you want a shared ride?",
            "Yes, sounds good.",
            "Your ride has been booked and the cab is coming.",
            "How much is it going to be and how long will the ride take?",
            "The ride will take about [approximate_ride_duration] minutes and costs [ride_fare].",
            "Thank you for helping. That is all I need at the moment.",
            "Have a good day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you tell me the time when I can watch the movie?",
            "Can you tell me the date when you want to watch the movie, and at what location? Is there a specific movie you want to watch?",
            "I want to watch the movie Little, and for it to be shown in Sonoma on 2nd of this month.",
            "I see that there is [count] showtime for the movie you are interested in. The show time will be at [show_time] in [theater_name].",
            "Seems nice to me.",
            "Do you want to buy tickets for this movie?",
            "No, I am not willing to buy tickets for the movie now.",
            "Is there something else I can help you with?",
            "I will need a cab to go there?",
            "Is your destination [destination]? Can you tell me, for how many people you need the cab?",
            "That's right. I will need the cab for 2 people.",
            "Is it a problem for you to have a shared ride?",
            "I am fine with having a shared ride.",
            "Can you please confirm that you want to have a shared ride cab for [number_of_riders] people to arrive to [destination]?",
            "That's right. Can you tell me how much it will cost?",
            "Your requested cab has been booked, and is already on the way. The cab ride will cost you [ride_fare].",
            "I appreciate your help very much.",
            "Is there something else you need from me?",
            "Nothing. I am thankful for the help you provided.",
            "Have a wonderful time!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hello, can you please help me find a 3d movie to watch on March 6th? I am hoping to view it at the Petaluma.",
            "Hello! Yes, I can certainly help you with that. I just need to know what movie you are interested in viewing.",
            "I would like to watch Shazam.",
            "There is [count] showtime for this movie at [show_time] at the [theater_name].",
            "That sounds good to me.",
            "Would you like me to help you purchase tickets?",
            "No, thank you. I just need help booking a cab to get there. It will be for 2 people.",
            "Okay, I can do that. Is a shared ride okay?",
            "I am fine with a shared ride.",
            "Is the destination address [destination]?",
            "Yes, that is correct.",
            "Please confirm: You would like a cab for [number_of_riders] people to go to [destination]. Shared rides are OK.",
            "Yes, that is correct.",
            "I have booked your cab and it is on its way to your location.",
            "Thank you for your help, that will be all!",
            "Have a great rest of your day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When is it showing?",
            "What show are you talking about? Also, what city are you in and what day would you like to see it?",
            "I'm talking about Dumbo. I'm in Alameda and want to see it on March 6th.",
            "Dumbo is being shown just [count] time on March 6th: at [show_time] in [theater_name].",
            "Perfect.",
            "Should I reserve seats for you?",
            "No, I'm not going to buy them yet.",
            "Do you need assistance with anything else?",
            "Can you get a taxi to take me there? I need a ride for three to 2317 Central Avenue. Shared rides are fine.",
            "You would like a shared taxi for [number_of_riders] to [destination]?",
            "Actually, make that ride just for one. And change the destination to 14480 Big Basin Way.",
            "You would like a taxi for [number_of_riders] to [destination]?",
            "That's right. What's the price?",
            "The taxi should be here momentarily. Its price is [ride_fare].",
            "How long will the trip be?",
            "[approximate_ride_duration] minutes.",
            "Thank you very much. I don't need anything else.",
            "Enjoy your day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hey! Please may I know at what time can I watch the movie?",
            "When you wish to watch this movie?",
            "Probably on Sunday this week I want to watch the movie, Pet Sematary.",
            "In which location you wish to watch the movie?",
            "Please can you search in Daly City and see to that if any movies shown?",
            "Sure. There is only [count] show time for this movie in [theater_name] at [show_time].",
            "Is it a comic movie?",
            "Nope, its a [genre] movie.",
            "What's the cost of the ticket for the movie?",
            "It's [price] for each person.",
            "Pretty cool...",
            "Do you wish to buy tickets for this movie?",
            "Nope, not right now. Please can you get me a cab to reach that place.",
            "Sure! Are you looking for a self or shared ride? How many would be travelling? so, do you wish to reach the place [destination], right?",
            "Yup, you're right. Three of us would be travelling.",
            "So, are you okay with a shared ride?",
            "Yup! sounds perfect.I have to go to The Drawing Center.",
            "Please can you confirm me that you wish to book a shared ride for [number_of_riders] people to go to [destination], right?",
            "Yup, sounds good. What is the duration of this journey? What is the cost of the ride?",
            "The journey will last for about [approximate_ride_duration] minutes and it would cost [ride_fare]. I've booked the cab for you and its on the way.",
            "Thanks much for your help",
            "Is there anything to help you?",
            "Nope, thanks much for all your support.",
            "Have a wonderful day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch CineLux Tennant Station. What time is that available to watch?",
            "What date do you prefer and where is your location?",
            "I want a regular show in Morgan Hill for tomorrow. Please find me a movie.",
            "What movie?",
            "I like Breakthrough.",
            "I found a show at [show_time] un [theater_name].",
            "May I know the address of the theater and what kind of movie is that?",
            "The theater is at [street_address] and it's a [genre] movie.",
            "That's great.",
            "Will I buy you tickets?",
            "No, please help me find a cab going there.",
            "Do you prefer shared ride?",
            "It's fine.",
            "For how many people?",
            "For 1 only.",
            "Okay, you want a shared ride for [number_of_riders] people going to [destination]. Please confirm.",
            "Yes, that's good. How much is the ride sost and how long is the ride going to be?",
            "The ride costs [ride_fare] and about [approximate_ride_duration] minutes. Your ride is booked now and cab is on it's way!",
            "Thank you.",
            "Anything else I can help you with?",
            "No, thanks.",
            "You are welcome."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time is the movie available that I want to watch?",
            "What day and city do you want to watch it in?",
            "I want to watch a movie in Emeryville on March 8th.",
            "Do you know what movie you want to see?",
            "I want to see Pet Sematary.",
            "One show is playing at [show_time] at [theater_name].",
            "What other time is the movie playing?",
            "That is the only showtime for the movie. Do you need something more?",
            "See if you can find showtimes for it on the 2nd of this month.",
            "Search revealed [count] showtime which is at [show_time] at [theater_name].",
            "What is their address and how much does a ticket cost?",
            "They are located at [street_address] and the cost is [price] a ticket.",
            "That works for me. Book me a shared cab for two people to get there.",
            "You want a shared cab for [number_of_riders] people to arrive at [destination]. Is that right?",
            "That is right. What is the ride duration and what is the total bill?",
            "Your booking is complete and your ride is coming right now. The ride duration is [approximate_ride_duration] minutes and costs [ride_fare].",
            "Thanks a bunch.",
            "Do you need something more?",
            "No, that is all. Thanks.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I see it? I want to see it on the 9th of March.",
            "What movie do you want to see?",
            "I want to see Breakthrough.",
            "In what city?",
            "Look in San Ramon.",
            "There are [count] showtimes for it. It's playing at [show_time] at the [theater_name].",
            "How much does it cost? What genre is it?",
            "It's a [genre] film and a ticket costs [price].",
            "What is the other showtime?",
            "The other time is at [show_time] at [theater_name].",
            "Great, that's better.",
            "Do you want tickets?",
            "No, not now.",
            "May I assist you with another task?",
            "I want a cab to go to that theater.",
            "Are you okay sharing a ride?",
            "Yes I am.",
            "How many seats do you want?",
            "Make it for two. Becky is coming with me.",
            "Are you heading to [destination]?",
            "Yes, that's the address.",
            "Please confirm the following: Booking a shared ride for [number_of_riders] and arriving at [destination].",
            "Yes, that works. How long is the ride and what's the price?",
            "Your ride is booked and the cab will meet you soon. The ride will be about [approximate_ride_duration] minutes and cost [ride_fare].",
            "Thank you for the help!",
            "Do you want something else?",
            "No, thanks for the help.",
            "Have a good day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time on the 6th of this month can I watch dogman?",
            "Where are you located?",
            "I want to see it in 3d at the opera plaza in SF",
            "There is [count] showtime for that movie at [show_time] at [theater_name].",
            "What is the cost of the ticket?",
            "It is [price] for each person.",
            "That sounds great.",
            "Should I order the tickets for you?",
            "No, not yet. I would need a cab to get there.",
            "Would you be going to [destination]? Would you mind a shared ride? How many persons would you be traveling with?",
            "That won't be an issue. I want a shared ride for 2.",
            "You would be going to [destination] using a shared ride for [number_of_riders] individuals?",
            "Yes, that would be great. What is the duration of the trip?",
            "Your ride is on its way. The trip is around [approximate_ride_duration] minutes.",
            "Thank you very much.",
            "Is there anything else?",
            "No. Thanks a lot.",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch a movie? I want to see a flick in Morgan Hill on March 8th.",
            "What movie do you want to see?",
            "Breakthrough, I hear it's good.",
            "There is on showing at [show_time] at [theater_name].",
            "Sounds great. Find me a cab too.",
            "Are you going to [destination]. Would you like to share a ride?",
            "Yep that's good. I am okay sharing a ride too.",
            "How many people do you want the cab for?",
            "It's for two.",
            "Please confirm the following details: You want a cab for [number_of_riders] to go to [destination]. You are okay sharing a ride.",
            "Yes, that works. How much is it? And how long is the ride?",
            "Your ride was booked successfully. It's [ride_fare] and will last around [approximate_ride_duration] minutes.",
            "Thank you!",
            "Do you want further assistance?",
            "No, thanks for the help!",
            "Have a very wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I am looking for a movie to watch at Century at Tanforan.",
            "Do you know what movie you want to see? When do you want to see it? Where are you located?",
            "If possible search in San Bruno for the 2nd of this month. And I want to go watch Teen Spirit.",
            "There is [count] playing at [show_time] in [theater_name].",
            "Where is the theater?",
            "It is in [street_address].",
            "Sounds great, I need to find a cab for my friend and me. It is okay if it is a shared ride.",
            "For how many people is the ride?",
            "For only 2 people.",
            "Please confirm: Getting a shared ride cab for [number_of_riders] people to go to [destination].",
            "That is correct, how much will it cost?",
            "The cab is on its way and it costs [ride_fare].",
            "How long will the ride be?",
            "The ride lasts about [approximate_ride_duration] minutes.",
            "Thanks a lot, that would be all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When can I watch it?",
            "What movie would you like to watch, and on what date?",
            "I was to see Captain Marvel on March 1st?",
            "Where would you like to see it?",
            "I want to see a 3d show in Newark.",
            "There is a [show_time] showing at [theater_name].",
            "Are there any other times at AMC NewPark? I'd like to go next Monday?",
            "There is [count] showtime next Monday at [show_time] at [theater_name].",
            "Okay, how much are tickets? What type of movie is it?",
            "Tickets are [price] per person. It is an [genre] movie.",
            "Okay, that sounds good. I'd like to arrange for a cab to go there.",
            "How many people will be going?",
            "Just one person. I need to get to 400 Newpark Mall.",
            "Are you okay with a shared ride?",
            "Yeah shared rides are fine.",
            "Okay, so you would like a cab for [number_of_riders] person headed to [destination], is that correct?",
            "Yeah that's fine. How much will it cost? How long does it take to get there?",
            "Your cab is booked and is on the way. The total cost is [ride_fare] and the trip takes about [approximate_ride_duration] minutes.",
            "Great, thanks. That's all I need right now.",
            "Alright, have a nice day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to watch a movie at Veranda LUXE Cinema in Concord, on March 2nd. What times are available?",
            "Which movie would you like to watch?",
            "The Curse of La Llorona",
            "There's [count] show at [show_time] in [theater_name]",
            "It's perfect! Thanks!",
            "Do you want to book a ticket now?",
            "Not now, thanks. I need a cab for 2 people to go there. A shared ride is fine, I have to go to 2035 Diamond Boulevard",
            "A cab in a shared ride for [number_of_riders] people to go to [destination]: do you confirm?",
            "No, It's for one people",
            "A cab for [number_of_riders] people in a shared ride. Is it correct?",
            "No, I should go to 470 49th Street B",
            "A shared ride to go to [destination]. Do you confirm?",
            "Yes, I confirm. How long will I get to my destination?",
            "About [approximate_ride_duration] minutes. The cab is coming",
            "Thank you so much. It's all for now",
            "Have a nice day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "can you tell me what time can I watch it?",
            "Can you please tell me the name of the movie you want to watch?",
            "I want to watch an imax show of The Curse of La Llorona on 1st of March.",
            "Which city do you want me to look in?",
            "Search for the movie shows in Larkspur.",
            "There is [count] showtime at [show_time] in [theater_name].",
            "can you tell me the price of the ticket and the address of the theater?",
            "The price of the ticket is [price] per person and the address of the theater is [street_address].",
            "That sounds good to me. Can you book a shared ride for 2 people?",
            "Please confirm: You want me to book a shared ride for [number_of_riders] people in a cab to [destination].",
            "Yes, That is correct. Can you tell me the duration and cost of the ride?",
            "I have successfully booked your ride. The duration is [approximate_ride_duration] minutes and the price is [ride_fare].",
            "Okay. Thank you so much!",
            "Is there anything else I can help you with?",
            "No. That will be all. Thank you!",
            "I am glad I could help. Have a nice day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to go watch a movie, what are the showtimes?",
            "What movie do you want to see?",
            "I want to go see Captain Marvel.",
            "When do you want to go?",
            "Find something on the 1st.",
            "Where do you want to look for?",
            "If possible look for imax showtimes at AMC Saratoga in San Jose.",
            "There is a showtime at [show_time] in [theater_name].",
            "What is the address of the theater?",
            "The address is [street_address].",
            "That sounds great, I will need a cab to get there.",
            "For how many people do you want the cab for? And do you want a shared rode?",
            "Just for one person.",
            "Do you want a shared ride?",
            "Never mind, make it for 2 people. And it is fine if it is a shared drive.",
            "Please confirm: Getting a shared ride cab for [number_of_riders] people to go to [destination].",
            "That is correct. How much is it?",
            "The cab is on its way. It has a cost of [ride_fare]",
            "Thanks, that would be all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch a film?",
            "What film do you want to see?",
            "How about Little?",
            "Where do you want to see it, and on what date?",
            "How about in Milpitas on the 2nd of this month?",
            "There's a showing at [show_time] at [theater_name].",
            "That sounds good to me.",
            "Do you want me to get you tickets?",
            "No thanks, I don't want to buy right now.",
            "Do you need help with anything else?",
            "Yes please, I need a cab to get there.",
            "For how many people?",
            "There will be 2.",
            "Do you want a shared ride? And will you be going to [destination]?",
            "Yes, that's the place. And I'm fine with a shared ride.",
            "Please confirm: you'll be traveling to [destination] in a shared cab for [number_of_riders] people.",
            "Yes, that's great. How much is it and how long is the ride?",
            "The cab is on it's way. It should take about [approximate_ride_duration] minutes and it's [ride_fare].",
            "Thanks for your help.",
            "Can I help you with anything else?",
            "No thank you, that'll be it.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch red joan at piedmont theatre",
            "Where are you located and what date do you want to watch it",
            "Can you find a show for me in oakland next monday",
            "There is a show at [show_time] in [theater_name]",
            "perfect, can you get me a cab for 4 people to go to 5133",
            "please confirm your shared ride cab for [number_of_riders] people to go to [destination]",
            "yes please, what is the total cost",
            "it will be [ride_fare]",
            "Thanks",
            "anything else i can do for you",
            "no that's it",
            "have a nice day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you tell me what time can I watch it?",
            "What is preferred Movie, date and city for the show?",
            "Search for movie shows of The Man Who knew Too Much on March 1st in Palo Alto.",
            "There is [count] showtime at [show_time] in [theater_name].",
            "Can you find me the address of the theater?",
            "The address of the theater is [street_address].",
            "Can you find me the category of the movie?",
            "It comes under [genre] movies.",
            "Okay. That sounds good to me.",
            "Do you want me to buy the tickets?",
            "No. Don't do it now. Can you book a cab for me to go there?",
            "What is your preferred type of ride and for how many people?",
            "Find a shared ride for 1 people.",
            "Please confirm: You want me to book a shared ride for [number_of_riders] people in a cab to go to [destination].",
            "Yes, That is correct. Can you find me the total cost?",
            "I have successfully booked your ride and the cab is on the way. The total cost is [ride_fare]",
            "What is the duration of the ride?",
            "The duration of the ride is sbout [approximate_ride_duration] minutes.",
            "That will be all. Thank you!",
            "I am glad I could help. Have a good day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When can I watch the movie?",
            "Which movie? Your location?",
            "Breakthrough at Regal Crow Canyon in San Ramon.",
            "Which date?",
            "Next Wednesday at THE LOT City Center.",
            "I found a show at [show_time] in [theater_name].",
            "What kind of movie?",
            "[genre].",
            "Great.",
            "Want to buy tickets?",
            "No. Will you reserve a cab to go there?",
            "Is a shared ride okay?",
            "Yes.",
            "How many people will be going to [destination]?",
            "Two.",
            "Please confirm a shared ride for [number_of_riders] to [destination].",
            "Great. What the cost and how long is the ride?",
            "I've reserved the cab for [ride_fare] for [approximate_ride_duration] minutes.",
            "Thanks. That's all.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time can I see a movie?",
            "Which movie would you like to see? What is the location? What is the date?",
            "I need movies in Martinez, on the 6th and I need Dumbo.",
            "There is one show at [show_time] in [theater_name].",
            "Okay, that sounds good. I need a cab there.",
            "How many people are in your cab? Would you like a shared ride? Would you like to go to [destination]?",
            "Yes, that works, for 1 person and I am okay with a shared ride.",
            "Please confirm the following details. You would like to go to [destination] in a cab for a party of [number_of_riders]. The ride may be shared.",
            "Yeah, that's it. How long is the ride and what's the price?",
            "Your ride is now booked and the cab en route to your location. The ride will last about [approximate_ride_duration] minutes and will cost [ride_fare].",
            "Thank you for that.",
            "Is there anything else that you may need?",
            "No, thank you.",
            "Of course. Have a wonderful day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a movie later today.",
            "In which city?",
            "Antioch, look at AMC Deer Valley.",
            "Which movie?",
            "Find a 3d showing for Breakthrough.",
            "I found [count] showtime at [show_time] at [theater_name].",
            "What the genre and address?",
            "[genre] and [street_address].",
            "Good, Get a shared ride there.",
            "For how many?",
            "Three.",
            "Please confirm: [number_of_riders] seats on a shared ride to [destination].",
            "Yes.",
            "Your ride's on its way.",
            "Thanks.",
            "Anything else?",
            "No thanks.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you search for movies in Moraga at the Rheem Theatre and tell me the times please?",
            "What movie would you like to see?",
            "I would like to see Hotel Mumbai.",
            "And on what date would you prefer to see it?",
            "I would like to see it next Tuesday.",
            "There is a show at [show_time] at [theater_name].",
            "That sounds good, is there a cab available?",
            "Will you be going to [destination] and how many people is this for? Would a shared ride be ok?",
            "Yes, that is perfect, there is just 1 person and a shared ride is fine.",
            "Please confirm that you are going to [destination] and it is for [number_of_riders] person and you would like a shared ride.",
            "Yes, that's perfect and can you tell me the cost?",
            "I have booked your ride and it is on the way. It will be [ride_fare].",
            "Thanks so much for your help, that will be all.",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'm looking to go to the movies at the AMC Deer Valley on the 6th",
            "In which city?",
            "Movies in Antioch please",
            "What movie are you interested in?",
            "How about Missing Link",
            "That movie is playing at [show_time] at the [theater_name]",
            "What genre is it",
            "That's a [genre]",
            "Ok good. Book me a ride there please",
            "For how many people?",
            "Two of us will go",
            "And that's to [destination], right?",
            "Yes that's right",
            "Is a shared ride ok?",
            "Yes that's fine",
            "Please confirm: booking a shared ride to [destination] for [number_of_riders] people",
            "Yes book that. How long will it take?",
            "Your ride is on the way now. It should be about a [approximate_ride_duration] minute trip",
            "Thanks so much",
            "Take care"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to see a movie.",
            "When would you like to see it?",
            "On the 2nd of this month would be great.",
            "Do you have a specific movie you want to see?",
            "I reallt want to see Dumbo",
            "What city would you like to see it tin?",
            "I want to watch it in San Leandro.",
            "There is only [count] showing and it is at [show_time] in [theater_name].",
            "Awesome, Can you get me a cab.",
            "Will you be going to [destination]?",
            "Of course.",
            "How many people will be going? Would you like a more cost effective shared ride?",
            "One person and a shared ride is great.",
            "Just to confirm you would like a shared cab for [number_of_riders] peroson going to [destination].",
            "Yes that is fine.",
            "Your cab is on the way.",
            "Thanks that will be all.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Will you find movies at Summerfield Cinemas in Santa Rosa on 2nd of this month?",
            "What movies?",
            "Wild Nights with Emily.",
            "I found [count] showtime at [show_time] in [theater_name].",
            "Great.",
            "Want to purchase tickets?",
            "No. Will you find a cab to go there?",
            "You want a shared ride to [destination]?",
            "Yes, a shared ride.",
            "How many people?",
            "One.",
            "Please confirm [number_of_riders] shared ride to [destination].",
            "That's fine. What's the duration?",
            "Your cab is on its way. The ride is [approximate_ride_duration] minutes.",
            "Thanks.",
            "Anything else?",
            "No, thanks.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I see the movie?",
            "Tell me what movie you want to watch along with the location and the date.",
            "I want to see the movie Dumbo on the 1st in San Jose.",
            "Search revealed [count] results. One show is playing at [show_time] in [theater_name].",
            "What other time is it playing?",
            "It is also playing at [show_time] at [theater_name].",
            "How much does the movie cost?",
            "It is [price] a person.",
            "What genre of movie is it?",
            "It is under the [genre] genre.",
            "That works for me. I need a cab for one to get to 2306 Almaden Road.",
            "You want a shared ride for [number_of_riders] person to get to [destination]. Is that right?",
            "Make it for two passengers.",
            "You want a shared ride for [number_of_riders] people. Is that right?",
            "That is right. Can you tell me the cost and the duration of the ride?",
            "Your cab is coming for you right now. The ride duration is [approximate_ride_duration] minutes and the total cost is [ride_fare].",
            "That is all. Thanks.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When can I watch the movie?",
            "What movie and date?",
            "Curse of La Llorona on Saturday this week.",
            "Location?",
            "Regal Crow Canyon in San Ramon.",
            "I found [count] showtime at [show_time] in [theater_name].",
            "What kind of movie? How much?",
            "[genre] at [price] per person.",
            "Great. Will you reserve a cab to go there?",
            "Do you want a shared ride to [destination]? How many people?",
            "A shared ride for two.",
            "Please confirm a shared ride for [number_of_riders] to [destination].",
            "Yes.",
            "Your ride is on its way.",
            "What's the duration?",
            "[approximate_ride_duration] minutes.",
            "Thanks.",
            "Anything else?",
            "No, that's all.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to go to movies for which I need your help. Can you search for the one which suits my taste and also I want to know the show times.",
            "In Which place and what date do you want to watch the movie.",
            "I want to watch it in Vallejo on this Saturday. Search the one for me accordingly.",
            "Do you have any particular movie in your mind?",
            "Yes, I like to watch Hellboy. Can you check the show time for me.",
            "Found one Show time at [show_time] in [theater_name]. How about that?",
            "That is good and get me a Cab to go there.",
            "Please confirm the address of destination as [destination]. Also for how many person do you want to book the cab and what type of ride you want?",
            "I can adjust with shared ride. Please book it for 3 persons.",
            "Need your confirmation to book a cab for [number_of_riders] to [destination].",
            "That is correct and what is the cost and time will be taken for this ride?",
            "The cost is [ride_fare] and the time taken by it to reach the destination will be around [approximate_ride_duration] minutes. I have booked the cab and it will reach you soon.",
            "Thanks and That's all for now.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What are the times I can watch at Brenden, Vacaville?",
            "Where do you want to watch which movie?",
            "I want to go see Hellboy i Vacaville.",
            "On which day?",
            "I want to see it on the 6th of March.",
            "[theater_name] has [count] showtime for [show_time].",
            "I need the address then please.",
            "The address you need is [street_address].",
            "What category does that movie fall into?",
            "It is considered a [genre] movie.",
            "Great, I want to take a cab.",
            "How many people will need a cab ride?",
            "There will be four or us and we don't mind it a shared ride.",
            "Okay a shared ride for [number_of_riders] fares with [destination] as the destination, correct?",
            "They all just backed out so I only need it for one.",
            "Change to [number_of_riders] fare for a shared ride to [destination] is that right?",
            "You got it.",
            "The cab has your received your request and is en route as we speak.",
            "Hey you helped a lot Bye now.",
            "Have a best day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you tell me timings for a regular show of Little?",
            "What is your preferred date and city for the movie?",
            "Search for the movie shows in Mountain View on 5th of this month.",
            "There is [count] showtime for the movie at [show_time] in [theater_name].",
            "Can you tell me the price of the ticket and the category of the movie?",
            "The price of the ticket is [price] per ticket and the movie comes uner [genre] movie.",
            "That sounds good to me.",
            "DO you want me to buy tickets for you?",
            "No, Don't buy the tickets now. Can you get me a cab to there?",
            "Which type of ride and for how many people should i book the cab for?",
            "Book a shared ride for 2 people in a cab to 1500 North Shoreline Boulevard.",
            "Please confirm: You want me to book a shared ride for [number_of_riders] people in a cab to [destination].",
            "Yes, That is correct.",
            "I have successfully booked your ride and the cab will reach here in [approximate_ride_duration] minutes.",
            "That will be all. Thank you!",
            "I am glad I could help. Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch it.",
            "What is your location and what date would you like to watch it on?",
            "Can you look in SF. I want to see an IMAX show on the 8th of this month.",
            "What movie did you want to watch?",
            "The Mustang at United Artists Stonestown Twin.",
            "There is a [show_time] showing at the [theater_name].",
            "How much is admission and what is the address?",
            "The ticket is [price] per person and the address is [street_address].",
            "Sounds good to me. I want to get a cab for three people, I am okay with a shared ride.",
            "Please confirm the following details: One shared ride for [number_of_riders] people to [destination].",
            "Yes, how much is that. Also, how long is the ride?",
            "Your ride is on its way. It will be [ride_fare] and the ride is about [approximate_ride_duration] minutes.",
            "Thank you!",
            "Is there anything else I can help you with.",
            "No, thank you.",
            "Have a good day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time will I be able to watch it? I want to view it on March 9th.",
            "Where are you located?",
            "Can you do a search for movies being shown in San Francisco.",
            "What is the movie you want to watch?",
            "I would like to view the movie on the 2nd of this month. I would like to see Hotel Mumbai. Any kind of show would be okay.",
            "I found [count] showtime for the movie at [show_time] at the [theater_name].",
            "That sounds fine.",
            "Do you want to buy tickets?",
            "No, I am not wanting to buy tickets now.",
            "Is there anything else I can do for you?",
            "I would like to get a cab to get there.",
            "Are you interested in a shared ride? What number of people do you need the cab for? Are you heading to [destination]?",
            "Yes that works. It's for 2 people and I am fine with a shared ride.",
            "Please make confirmation of the following details: you are wanting a shared ride for [number_of_riders] people to go to [destination].",
            "Yes, that will work.",
            "Your ride has been confirmed and the cab is on the way to get you.",
            "Thanks very much for your help.",
            "Is there anything else you would like help with?",
            "No that's it. I appreciate the help very much.",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch Dumbo, and I want to know at what time can I watch it.",
            "Can you tell me the location where you want to watch the movie?",
            "I want to watch the movie at Century Oakridge in San Jose on next Friday.",
            "I can see that there is a show of the movie in [theater_name] at [show_time].",
            "That's seem nice.",
            "Do you want to buy tickets for this movie?",
            "No, I am not in need of buying the tickets now.",
            "Is there something else I can help you with?",
            "I would like to have a cab to go there.",
            "For how many people will you be needing the cab? Do you want to have a shared ride?",
            "I need the cab for 2 people, and I am fine with having a shared ride.",
            "Is your destination [destination]?",
            "Yes, that's what I want.",
            "Can you confirm that you want a shared ride cab for [number_of_riders] people to go to [destination]?",
            "Yes, that suits me well. Can you tell me how long will the ride last, and how much will it cost me?",
            "Your requested cab has been booked, and is already on the way. The ride with your requested cab will last about [approximate_ride_duration] mintues, and it will cost you [ride_fare].",
            "I appreciate your help very much.",
            "Is there something else I can help you with?",
            "Nothing. I am thankful for your help.",
            "Have a wonderful time!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I see it!?",
            "Where are you currently located?",
            "Look for movies in Union City.",
            "What day do you want to see a film?",
            "On the 5th of March.",
            "What movie do you want to see?",
            "I want to watch Captain Marvel",
            "There is one show at [show_time] at [theater_name].",
            "What is the address?",
            "The address is [street_address].",
            "Sounds great. I want a cab to get there.",
            "For how many?",
            "For me, 1 person.",
            "Are you okay sharing a ride?",
            "Yes, I am.",
            "Please confirm the following: You want a shared cab for [number_of_riders] and you will arrive at [destination].",
            "Yes I do. How much is it?",
            "Your ride is booked. It will cost [ride_fare].",
            "Thanks for the help.",
            "How else can I help?",
            "No thanks! Goodbye!",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to go watch Hotel Mumbai at Century at Pacific Commons, what showtimes are there?",
            "When and where do you want to watch it?",
            "Look for a showtime this Saturday in Fremont.",
            "There is a showtime at [show_time] in [theater_name].",
            "That sounds great, I will need a cab to get there. Can you find a cab for one person to 43917 Pacific Commons BOulevard?",
            "Do you want a shared ride?",
            "It is okay if it is a shared ride.",
            "Please confirm: Getting a shared ride cab for [number_of_riders] person to go to [destination],",
            "That is correct, how much will it be? And do you know the time to go there?",
            "The cab is on its way and the ride lasts around [approximate_ride_duration] minutes. It costs [ride_fare]",
            "Thanks a lot, that would be all.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "When can I watch it?",
            "On what date are you planning to watch it?",
            "I would like to watch it on Saturday this week.",
            "Which movie would you like to watch, and in which city?",
            "I want to watch Dumbo in or around Campbell.",
            "There is [count] show for Dumbo at [show_time] in [theater_name].",
            "That sounds good. I would like a cab to get there.",
            "How many people will be going and is a shared ride okay? Are you headed to [destination]?",
            "Yes, the address is correct. The cab is for two people and a shared ride is fine.",
            "Booking a shared cab for [number_of_riders] people to [destination]. Shall I proceed?",
            "Yes, please go ahead. How much will it cost and how long will it take to get there?",
            "Your cab has been booked and it is on its way. The ride is expected to take [approximate_ride_duration] minutes and it will cost you [ride_fare].",
            "Thank you for the assistance. That'll be all for now.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I like to watch the movie Red Joan at Embarcadero Center Cinema in San Fran. Can you find me the Show times for this movie?",
            "When do you plan to watch this movie?",
            "Search for the show time on the 6th which is the convenient date to me.",
            "Found a show time at [show_time] in [theater_name]. Is that okay to you?",
            "Can you tell me which kind of movie is this?",
            "It is a [genre] based movie. And it is the nice one to watch.",
            "That is great. Need one more favor from you. Book me a Cab to go to the theater.",
            "For how many persons you need to book the cab and please confirm whether you are going to [destination] now?",
            "Yes, to the same place and please book it for 1 person.",
            "Tell me what type of ride is okay to you? or let me know whether you will be comfortable with shared ride?",
            "Yes, I can adjust with Shared ride.",
            "Please confirm to book a Cab with shared ride for [number_of_riders] people to [destination].",
            "That is correct.",
            "I have booked the cab and the same will reach you soon.",
            "What is the cost for that ride and what will be the time taken by the cab to reach the final place.",
            "I costs [ride_fare] and it will reach the destination in [approximate_ride_duration] minutes.",
            "That's all I want and thanks for the same.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time is it on?",
            "What movie do you want to check?",
            "I want to check Shazam.",
            "Where and on which date do you want to watch the movie?",
            "I am looking for a movie on the 2nd of this month in San Fran.",
            "There are [count] showings. Is [show_time] at the [theater_name] okay with you?",
            "What is the other time?",
            "There is another showing at [show_time] at the [theater_name].",
            "What is the venue address and how much is a ticket?",
            "The venue address is [street_address]. The ticket is [price] per person.",
            "Sounds great. I will also need a shared cab for two.",
            "Please confirm you want to book a shared ride for [number_of_riders] going to [destination].",
            "Actually, it's only for 1.",
            "Please confirm you want me to book a ride for [number_of_riders] going to [destination].",
            "Yes. How long is the ride?",
            "The ride is approximately [approximate_ride_duration] minutes and has been successfully booked.",
            "Thanks for everything.",
            "Is there anything else I can assist you with today?",
            "No. Thanks a bunch.",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Hi, could you search for showtimes for the Hellboy movie in the Cloverdale area?",
            "What is your preferred date to watch the movie?",
            "I would like to watch it on 1st of March.",
            "There is a show at [show_time] at [theater_name].",
            "I see, may I know the genre and cost of this movie ticket please?",
            "This is a [genre] movie which will cost you [price] per individual.",
            "That sounds great!",
            "Would you like to purchase the movie tickets?",
            "No need to, thanks!",
            "Do you require further assistance?",
            "Could you get me a cab ride there please?",
            "Sure, how many people will you be travelling with?",
            "I will be travelling alone, so this is for 1 person.",
            "Will you be travelling to [destination]?",
            "Sure, this works for me.",
            "Would you like a shared ride?",
            "Sure, I am fine with that.",
            "Please confirm your booking for [number_of_riders] person on the shared ride to [destination].",
            "Sorry, could you change the booking for two people to Gay 90's Pizza Co. instead?",
            "Sure, please confirm your booking for [number_of_riders] people to [destination]",
            "That is fine with me. May I know how long will this trip take me and how much will this cost?",
            "Your ride has been booked and is on its way to you right now. This will take you [approximate_ride_duration] minutes and cost you [ride_fare].",
            "Sure, thank you!",
            "Do you require further assistance?",
            "No, that is all the help I need. Thank you!",
            "No worries, have a great day ahead!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you tell me at what time can watch the movie DUmbo at THE LOT City Center?",
            "Can you tell me the location where you want to watch the movie and at which date you want to watch it?",
            "I want to look for movies shown in San Ramon on 5th of March.",
            "There is [count] showtime for the movie. The movie will be shown at [theater_name] at [show_time].",
            "Can you tell me the price of the ticket for the movie?",
            "The ticket for this movie costs [price] per person.",
            "That seems right.",
            "Do you want to buy the tickets for the show of this movie?",
            "No, I am not willing to buy the tickets now.",
            "Is there something else I can do for you?",
            "I would like to have a cab to go there.",
            "Do you want to have a shared ride to go to [destination]?",
            "Yes, that suits me well. I do not mind having a shared ride.",
            "Can you tell me the number of people you need the cab for?",
            "I need the cab just for 1 person.",
            "Can you please confirm that you want to have a shared ride cab for [number_of_riders] person to go to [destination]?",
            "Yes, that's what I want. Can you tell me how much the fare for this cab will cost me?",
            "Your requested cab has been booked, and is already on the way. The cab you requested will cost you [ride_fare].",
            "I appreciate your help very much.",
            "Is there something else you need me to help you with?",
            "Nothing. I am thankful for the help you provided.",
            "Have a wonderful time!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you tell me the time when I can watch the movie?",
            "Can you tell me what movie you want to watch? What location would you prefer for the movie show? Do you have a preferred date for when you want to watch the movie?",
            "I want to find movies in Brentwood for Thursday next week. I would enjoy watching Curse of La Llorona.",
            "I am glad to say that there is a show of the movie at [show_time] in [theater_name].",
            "Can you tell me the price of the ticket, and the address of the theater where the movie will be shown?",
            "The theater can be found at the following address [street_address]. The ticket for the movie costs [price] per person.",
            "Seems nice. I will also need a cab to go there, and I need the cab for three people.",
            "Would you mind having a shared ride?",
            "A shared ride would be fine.",
            "Can you please confirm that you want to have a shared ride cab for [number_of_riders] people to go to [destination]?",
            "Alright, that would be fine. Can you tell me the cost of the cab fare, and how long will last the ride?",
            "Your requested cab has been booked, and is already on the way. Your journey with the cab is expected to last [approximate_ride_duration] minutes, and it will cost you [ride_fare].",
            "I appreciate your help very much. That would be all for now.",
            "Have a good time!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to see a movie next Friday at Century Union Landing.",
            "What movie?",
            "I want to see Curse of La Llorona.",
            "Where are you?",
            "Look for movies in Union City.",
            "I found [count] showtime at [show_time] at [theater_name].",
            "How much is the ticket? What is the address?",
            "The address is [street_address] and it is [price].",
            "Sounds good.",
            "Are you ready to buy tickets?",
            "No, not yet. I want to find a cab for 1 person.",
            "Please confirm, cab to [destination] for [number_of_riders] person. It is a shared ride.",
            "Yes, that is ok.",
            "Your ride is on the way.",
            "How much? How long is the ride?",
            "It will be about [approximate_ride_duration] minutes and cost [ride_fare].",
            "Thanks, that is all.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch it.",
            "What movie would you like to watch and what is your location?",
            "Can you look for Breakthrough in San Leandro.",
            "What day would you like to see it?",
            "The day after tomorrow.",
            "I found [count] showtime at [theater_name] at [show_time].",
            "Sounds good for me.",
            "Would you like to buy tickets?",
            "Not right now.",
            "Is there anything else I can help with?",
            "I need a cab to 15555 East 14th Street. I am okay with a shared ride.",
            "How many seats do you need?",
            "It is for 3 people.",
            "Please confirm the following: One shared ride for [number_of_riders] people to [destination].",
            "Thank you. How long is the ride and what is the cost?",
            "The ride will be [ride_fare] and is about [approximate_ride_duration] minutes.",
            "Thank you for everything.",
            "Is there anything else I can help you with?",
            "No that is all.",
            "Have a nice day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to watch a movie at AMC NewPark. What times is it available?",
            "What movie do you want to see and on what date?",
            "I want to see Little in Newark on the 7th.",
            "Search revealed [count] result. It is playing at [show_time] in [theater_name].",
            "What genre is it?",
            "It is under the [genre] genre.",
            "What is the price of a ticket?",
            "It costs [price] a person.",
            "That works for me. I need a taxi to get to 400 Newpark Mall.",
            "Is a shared ride okay with you?",
            "A shared ride is okay with me.",
            "How many people are in your group?",
            "the ride is for 1 person.",
            "You want a shared ride for [number_of_riders] person to [destination]. Is that right?",
            "That is right. What is the ride duration and the cost?",
            "The ride duration is [approximate_ride_duration] minutes, costs [ride_fare] and your ride is one it's way right now.",
            "Thanks a bunch. That is all.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Will you find movies in Emeryville?",
            "What movie and date?",
            "Family on 3rd of this month.",
            "I found [count]. [show_time] in [theater_name].",
            "Great. Will you reserve a shared ride there?",
            "How many?",
            "1",
            "Is [destination] the destination?",
            "Yes.",
            "Please confirm [number_of_riders] shared ride to [destination].",
            "That's fine. Duration of the ride?",
            "[approximate_ride_duration] minutes. Ride is reserved.",
            "Thanks. That's all.",
            "Have a wonderful day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time can I watch it in March 7th?",
            "What movie and location",
            "I want to watch high Life in Livermore",
            "I found [count] showtimes at [show_time] in [theater_name]",
            "What's the theatre address",
            "The address is [street_address]",
            "Great",
            "Wanna get the tickets?",
            "No I don't want it now. I want a cab to there",
            "Do you like shared ride",
            "Yes im okay with that",
            "For how many people ?",
            "Three people",
            "Please confirm you want to go to [destination] for [number_of_riders] people on a shared ride",
            "Yes great",
            "Your booking is confirmed and it's on its way to you",
            "What's the cost",
            "It's [ride_fare]",
            "Thanks a lot. That's all I need",
            "Have a wonderful day ahead"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I would like to watch Breakthrough as a 3d show on March 4th. What time could I see it?",
            "Where are you located?",
            "I am in San Leandro.",
            "There is a showing at [theater_name] at [show_time].",
            "Okay. Find me a cab to get there. A shared ride is ok.",
            "How many people would the cab be for?",
            "It is for two.",
            "Is your destination [destination]?",
            "Yep, that's right.",
            "Could you confirm that you need a shared can for [number_of_riders] to [destination]?",
            "Yeah, that is good. How much would it cost and how long is the ride?",
            "Your ride has been booked and the cab is on the way. The ride will take about [approximate_ride_duration] minutes and costs [ride_fare].",
            "Thanks for helping. That is all I needed help with.",
            "Have a good one."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you tell me the time when I can watch the movie?",
            "Could you please tell me the date for when you want to watch the movie, and at which location would you like for the movie to be shown? Can you also please tell me the movie you would prefer to watch?",
            "I want to watch the movie in Sonoma on 5th of this month. The movie I want to watch is Shazam! .",
            "I can see that there is one show of your requested movie at [show_time] in [theater_name].",
            "Seems nice. I will need also a cab to go there. I need the cab for one person, and I am fine if it is a shared ride. My destination is 4451.",
            "Can you please confirm that you want to have a shared ride cab for [number_of_riders] person to go to [destination]?",
            "That suits me well. Can you tell me the price of the cab fare?",
            "Your request for the cab has been made, and it is already on the way. The cab fare will cost you [ride_fare].",
            "I appreciate your help very much. That would be all.",
            "Have a wonderful time!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I am in a nice mood to watch some movies and I need your help to find some interested one for me.",
            "For which day I have to search for the movies to watch? Do you have any particular date in your mind?",
            "I have planned to watch it on 6th of this month that will be a convenient date to me.",
            "Tell me your present location so that I can search accordingly.",
            "Search it in Alameda.",
            "Do you have any preferred movie in your mind, if so let me know the same to search it fast and accurate.",
            "I like to watch a regular show of the movie Little in Walnut Creek. Can you search for the the show time of this movie?",
            "Yes, found [count] show time for the movie at [show_time] in [theater_name].",
            "Please let me know the genre of that movie and also I want to know the address of the theater for my reference.",
            "It is a [genre] movie and the address is [street_address]. Is that information enough to you.",
            "Yes, and I like the same.",
            "Shall I book the tickets to this movie now?",
            "No, I do not want it now and may be later.",
            "How can I help you further.",
            "I want to go to that theater and for which I need to book a Cab for me. Can you help me in this regard.",
            "Yes, how about a shared ride?",
            "Yes, it is okay with me.",
            "For how many persons, do you want me to book the cab?",
            "I need it for only 1.",
            "Please confirm to book a Cab with shared ride for [number_of_riders] to [destination].",
            "Yes, that is confirmed and let me know the cost for that ride.",
            "It costs [ride_fare] and I have booked the cab for your and the same will reach you soon.",
            "That is nice and thanks for the same.",
            "Any more help you need from me?",
            "No, that's all for now.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to find some nice movies and I would like to watch it in Santa Rosa on 1st of this month. Can you search for the show time?",
            "Which is your favorite movie to search for?.",
            "I like to watch the movie Little. Search for some convenient show times.",
            "Found 1 show time at [show_time] in [theater_name]. What about your opinion on this time, whether it is convenient to you?",
            "Let me know the address of the theater to decide.",
            "The address is [street_address]. Any more information you need about this movie.",
            "Yes, what is the genre of this movie and let us know the cost for this movie.",
            "It is a [genre] movie and the price per person is [price]. Is that okay to you.",
            "Yes, that is okay for me.",
            "Shall I book the tickets to this movie now?",
            "No, not now. Will decide later.",
            "How can I help you further.",
            "I want to go there for the movie for which I need your help to book a Cab.",
            "Let me know the number of persons in your team so that I can book the cab accordingly and also let me know whether shared ride okay to you?",
            "Yes, I can adjust with Shared ride and please book it for one.",
            "Please confirm to book a Cab for [number_of_riders] with shared ride to [destination].",
            "That is confirmed to proceed and get the cost details for that ride for my reference.",
            "Cost for this ride will be [ride_fare] and I have booked your Cab and the same will reach you soon.",
            "Thank you for your help.",
            "Any more help you need from me?",
            "No, that's all for today. Thanks.",
            "Have a good day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to see Gloria Bell at New Parkway Theater. What time can I see it. Also, any showing will do.",
            "In what city?",
            "Check Oakland please.",
            "What day do you want to see it?",
            "On March 6th.",
            "There's one show at [show_time] in [theater_name].",
            "Sounds great! I want a cab. Just for one. I am okay sharing a ride.",
            "Are you headed to [destination]?",
            "Yes, that's right.",
            "Please confirm the following: a cab for [number_of_riders], going to [destination]. You're okay sharing a ride.",
            "Yes, that's great.",
            "Your cab is booked.",
            "How much is it?",
            "It is [ride_fare].",
            "How long will the ride take?",
            "About [approximate_ride_duration] minutes.",
            "Thank you for the help!",
            "Do you require further assistance?",
            "No, thanks for your help!",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "find me some movie. I want to it on the 6th",
            "Where do you want to watch it?",
            "the Guild Theatre in Menlo Park",
            "Which movie do you want to watch?",
            "I wanna watch Red Joan",
            "There is one show in the [theater_name] at [show_time]",
            "Thats great",
            "Should i book it?",
            "No, not now",
            "anything else",
            "Get me cab to go there",
            "For how many people?",
            "For two people",
            "is [destination] ok?",
            "yes, make it for one person",
            "is shared ride ok?",
            "yea sure",
            "Please confirm: Booking a shared [destination] for [number_of_riders] person.",
            "yes thats right. Whats the ETA?",
            "Done. It will last [approximate_ride_duration] minutes",
            "Thanks. Thats all",
            "have a good day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I'd like to find an imax film to see in San Rafael, something at the Smith Rafael Film Center please.",
            "What movie are you interested in and on what date?",
            "I think I'd like to see Wild Nights with Emily on the 3rd of the month.",
            "There is an [show_time] show at [theater_name].",
            "What's the ticket price?",
            "It's [price] per seat.",
            "What type of film is it?",
            "The movie is in the [genre] genre.",
            "Great. Could I get a cab to 1118 4th Street then?",
            "For how many passengers?",
            "Just one and I don't mind if it's a shared ride.",
            "Confirming a shared cab for [number_of_riders] to [destination].",
            "Sounds good to me. What's the fare come to and how long will the ride be?",
            "The reservation is complete and the fare will be [ride_fare] for the ride, which will last approximately [approximate_ride_duration] minutes.",
            "Great, I'm all set then.",
            "Thank you so much."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch it?",
            "What movie are you interested in watching?",
            "I'd like to watch Red Joan if possible.",
            "Where are you located and when would you like to watch it?",
            "I'd like to find movies showing in Oakland Monday next week.",
            "[theater_name] are showing the film at [show_time].",
            "What is their address and what genre is the film?",
            "The theatre address is [street_address] and the movie is a [genre].",
            "Ok great. I'd like to arrange a cab to take me there. A shared ride would be fine.",
            "How many people are travelling by cab?",
            "There will be 3 people travelling.",
            "Okay so to confirm: You would like to book a cab for [number_of_riders] people to go to [destination] and are OK with a shared ride.",
            "Perfect. How long will the ride take to get to the destination.",
            "Your cab is booked and will be with you soon. Your journey will take around [approximate_ride_duration] minutes.",
            "Thanks for your help. I don't need anything else right now.",
            "Enjoy your day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time can I watch the movie.",
            "Please tell me the movie you wish to watch, the location and date when you want to watch it.",
            "Please show me show times for Shazam on the 5th of this month in Petaluma.",
            "There's a show at [show_time] at [theater_name].",
            "Please tell me the address for the theater as well as the ticket price.",
            "Tickets are [price] each and the theater is located at [street_address].",
            "OK, sounds great.",
            "Shall I go ahead and buy tickets for you?",
            "No, not at the moment.",
            "Is there anything else I can do for you?",
            "Please find me a shared ride cab to there.",
            "For how many persons?",
            "Three persons, please.",
            "Can you please confirm that you want me to get you a shared ride cab for [number_of_riders] to [destination].",
            "Yes, that's correct. How long to reach my destination?",
            "Your cab is on its way and it will take you about [approximate_ride_duration] minutes to your destination.",
            "Please tell me the fare cost.",
            "The fare is [ride_fare].",
            "Thank you for everything.",
            "Is there anything else you need?",
            "No, thanks for your help.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch Captain Marvel?",
            "Where are you located?",
            "Search in Morgan Hill.",
            "What date would you like to watch it on?",
            "I would like to watch it on the 9th.",
            "One show is playing at [show_time] in [theater_name].",
            "That sounds great.",
            "Do you want tickets?",
            "No, I don't want to buy tickets now.",
            "Could you help with something else?",
            "I need you to find me a cab to get there.",
            "Would you like a shared ride?",
            "A shared ride is fine.",
            "Are you heading to [destination]? How many people do you need the cab for?",
            "Yes, that sounds good. The cab is for 1 person.",
            "Could you confirm that you need a shared ride for [number_of_riders] person to go to [destination]?",
            "Yes, souns good. How long will the ride take and how much will it cost?",
            "The ride has been reserved and the cab is on its way. The ride will take about [approximate_ride_duration] minutes and it costs [ride_fare].",
            "Thank you so much for helping. I do not need anything else for now.",
            "Have a good one!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time is it on?",
            "Which movie?",
            "Hellboy.",
            "Location and date?",
            "Union City on the 6th.",
            "I found [count] showtime at [show_time] in [theater_name].",
            "Price?",
            "[price].",
            "Address and genre?",
            "[genre] and the address is [street_address].",
            "Good, get a cab there.",
            "For a shared ride? Number of passengers?",
            "Two, shared is fine.",
            "Please confirm: shared ride for [number_of_riders] to [destination].",
            "Yep.",
            "Your ride's on its way.",
            "Thanks, that's all.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch it at?",
            "Where are you located?",
            "In Brentwood.",
            "What day do you want to see it?",
            "On March 8th. I want to see it in 3d!",
            "What movie do you want to see?",
            "I want to see Captain Marvel.",
            "There is a showing at [show_time] at [theater_name].",
            "Sounds great!",
            "Do you want to buy tickets?",
            "No, not now. I want a cab to go there. It's for one. The address is 2525 Sand Creek Road.",
            "Please confirm the following details: You are booking a cab for [number_of_riders] person at [destination]. It's a shared ride.",
            "Yes, that works. How long will the ride be? How much does it cost?",
            "Your ride is booked! The cab will get to you soon. It will last about [approximate_ride_duration] minutes and costs [ride_fare].",
            "Thanks for the help.",
            "May I help you with a different task?",
            "No, thanks for the help.",
            "Have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Please find out the time I can watch it.",
            "Any particular date you'd like to watch it on?",
            "I'd like to watch it on March 2nd at Century Union Landing.",
            "Where are you located?",
            "Please search for showtimes for Pet Sematary in Union City.",
            "[show_time] is the [count] showtime for the movie, in [theater_name].",
            "How much does the ticket cost?",
            "The cost is [price] per person.",
            "All right, I like that. Please find me a cab to go there.",
            "Please confirm whether you destination is [destination], and the number of passengers the cab is for.",
            "Yes, that is correct, and the number of people is one.",
            "Do you mind sharing a ride?",
            "No, I don't mind sharing a ride.",
            "Thanks. Please confirm that you'd like [number_of_riders] seat in a shared ride going to [destination].",
            "That is correct. What's the cost?",
            "I have successfully booked your cab and it should be here shortly. The price is [ride_fare].",
            "About how many minutes is the ride?",
            "The ride is approximately [approximate_ride_duration] minutes.",
            "Thank you very much. You've been very helpful. That will be all for now.",
            "Thank you and have a wonderful day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time can i watch it?",
            "On which date and what movie you want to watch? which location you prefer?",
            "Could you find for movies shown in San Jose on next Thursday and i like to watch Breakthrough.",
            "There's one show in [theater_name] at [show_time].",
            "this is cool. I need a cab to go there.",
            "Is the location is [destination]? Are you interested in shared ride and cab is for how many people?",
            "Fine. Cab is for one people and shared ride is okay for me.",
            "Please give confirmation details: Your going location is [destination] and cab is for [number_of_riders] people with shared rise.",
            "No, i want to go 1737 post street.",
            "Please give confirmation details: Your going location is [destination] and cab is for [number_of_riders] people.",
            "Okay. this is perfect.",
            "Your riding booked successfully and cab is on its way.",
            "Thank you so much for your help. That's all i want now.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Find out what time it's available to be watched.",
            "Ok, which movie would you like to watch and where?",
            "Search The Curse of La Llorona playing in San Francisco.",
            "Which date am I searching?",
            "Look for the 1st of this month please.",
            "Alright, I found [count] showtimes for [theater_name]. I do show on playing at [show_time].",
            "Alright, reserve a ride share to get there please.",
            "Sure, just to confirm, you would like to go to [destination]. How many people will be riding?",
            "yeah, book the ride just for 1.",
            "Alright, please confirm booking a ride share for [number_of_riders] heading to [destination]. Is that correct?",
            "Yes that is right.",
            "Great, your ride is confirmed and in route.",
            "Thank you, for your help.",
            "Your welcome. will there be anything else?",
            "Nope, that's it.",
            "Ok, have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Could you find for movies shown in Walnut Creek and i like to watch Missing Link with imax show. At what time i can watch this movie?",
            "Any date you want to watch it?",
            "I like to see it on tomorrow.",
            "There's one show in [theater_name] at [show_time]",
            "This is cool. I like to get a cab to go there and it is for 1 people.",
            "Do you need a shared ride? Is the location is [destination]?",
            "Yes. This works for me. Shared ride is okay for me.",
            "Please give confirmation details: You need a shared ride and the cab is for [number_of_riders] people and the venue is [destination].",
            "This is okay for me.",
            "Your booking has been done and the cab is on its way.",
            "Thanks for your great help.",
            "Have a nice day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I see a film?",
            "What film do you want to see, and on which date?",
            "How about Red Joan on the 3rd of March?",
            "Where are you located?",
            "Can you find something in Albany?",
            "I found [count] showing. It's at [show_time] at [theater_name].",
            "That sounds great to me.",
            "Do you want to buy tickets?",
            "No thanks, I'll buy later.",
            "Do you need anything else?",
            "How about a cab to get there?",
            "A shared ride? And you're going to [destination]?",
            "Yes, that's great. I'm fine with a shared ride.",
            "How many people will be in the cab.",
            "One, just me.",
            "Please confirm: you need a shared cab for [number_of_riders] to [destination].",
            "Yes, that's great. How much will it be?",
            "Your ride is booked and on the way. It'll be [ride_fare].",
            "How long will the ride be?",
            "It should last [approximate_ride_duration] minutes.",
            "Thanks for your help, that'll be all.",
            "Have a nice day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Is Dumbo plying today in Santa Rosa.",
            "Yes. [count] show at [show_time] at [theater_name].",
            "Could you get me a taxi there? 1 person.",
            "To [destination]?",
            "Yes, that is right.",
            "[number_of_riders] to [destination]?",
            "Yes. How long is that? What's the fare?",
            "The car is coming. The ride is [approximate_ride_duration] minutes and will run you [ride_fare].",
            "Ok great. I'm good to go for now.",
            "Great. Enjoy. Speak later."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "I want to find a regular movie at Century Redwood City in Redwood City.",
            "What is the date and movie?",
            "The day after tomorrow and Shazam!",
            "At [theater_name], I have a [show_time] time.",
            "I want a cab to go to 825 Middlefield Road.",
            "How many seats do you need.",
            "It is for one.",
            "Do you want a shared cab?",
            "I am ok with shared.",
            "Confirm shared ride for [number_of_riders] to [destination].",
            "Yes I confirm that.",
            "Your ride is on the way.",
            "What is duration and cost?",
            "The cost is [ride_fare] and is [approximate_ride_duration] minutes.",
            "Thanks for the help.",
            "Is there anything else?",
            "That is all today.",
            "Have a great day."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time would it be showing?",
            "For which date?",
            "the 3rd of march",
            "Which movie are you referring to?",
            "To Red Joan.",
            "In which location?",
            "Somewhere in albany.",
            "There is [count] show at [show_time] at [theater_name].",
            "That would be great.",
            "You would like tickets?",
            "No, not yet. I would need to get a cab to get there.",
            "Would a shared ride be ok and for how many people? Are you heading to [destination]?",
            "Just me alone. 1 for a shared ride.",
            "You want a shared ride for [number_of_riders] to [destination]?",
            "That's exactly what I wanted.",
            "The cab will arrive shortly.",
            "You have been very helpful. I need no additional assistance.",
            "Enjoy yourself!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time can I watch at Lark Theater?",
            "What movie do you wnt to see?",
            "I want to see Invisibles.",
            "Where are you located and on what date do you want to see it?",
            "Could you look for this Sunday in Larkspur?",
            "I have [count] showtime for that movie. There is one show at [show_time] in [theater_name].",
            "Could you tell me the theater's address?",
            "The address of the theater is [street_address].",
            "How much does the ticket cost?",
            "The tickets are [price] per person.",
            "That sounds good.",
            "Do you need tickets?",
            "Not right now. I want to get a cab to go there for four people. A shared ride wouldbefine.",
            "Could you confirm that you want to go to [destination] for [number_of_riders] people and that you want a shared ride?",
            "Yes, that is good. How long is the ride and what is the price?",
            "Your ride has been booked and the cab is en route. The ride will take about [approximate_ride_duration] minutes and costs [ride_fare].",
            "Thank you for helping. I do not need anymore help right now.",
            "Have a good one."
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What time will I be able to watch it?",
            "What day and location were you interested in?",
            "Please search movies in Vallejo on the 7th of march.",
            "What movie would you like?",
            "Breakthrough for tuesday next week.",
            "There's [count] playing at [show_time] in [theater_name]",
            "awesome",
            "Shall I book tickets?",
            "No, not now. I'd like 1 cab to take me to 109 Plaza Dr. Gateway Plaza Center.",
            "Please confirm your booking: [number_of_riders] ride to [destination].",
            "Perfect, how long is this ride and how much?",
            "Your reservation is booked. This will be [ride_fare] and a [approximate_ride_duration] minute ride.",
            "Awesome, thanks.",
            "Can I help you with anything else?",
            "Nope, thanks all.",
            "Have a wonderful day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "What are its showtimes?",
            "Which movie do you want to watch, in which city and on what date?",
            "I want to watch Captain Marvel on the 4th of March in or around Livermore.",
            "There's a show at [show_time] in [theater_name].",
            "Is Missing Link showing at some other time in Livermore Cinema?",
            "There is [count] show at [show_time] in [theater_name].",
            "How much does the ticket cost?",
            "The ticket rate is [price].",
            "What is the genre of the movie and where is the theater located?",
            "It's a [genre] and the address of the theater is [street_address].",
            "Thank you for the information.",
            "Shall I get you tickets to the movie?",
            "No, not now.",
            "Is there anything else I can do for you?",
            "Can you get me a cab to go there?",
            "Does a shared ride work for you?",
            "Yes, that should be okay.",
            "Are you going alone or will someone be with you?",
            "The cab is for two people.",
            "Please confirm that you need a shared cab for [number_of_riders] to go to [destination].",
            "Yes, that's right. How much will the cab cost?",
            "Your cab has been booked and it is on its way. The ride will cost you [ride_fare].",
            "Thank you for the assistance. That'll be all for now.",
            "Have a great day!"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "Can you look for movies in Morgan Hill and what is the show timing?",
            "When do you need to watch the movie?",
            "I need to watch it on the 2nd",
            "Which is your choice of movie?",
            "I have to watch Breakthrough",
            "I have looked in [count] showtime for the movie and it is at [show_time] in [theater_name]",
            "Perfect for me",
            "You need to buy tickets?",
            "No, i don't want to buy tickets now",
            "Is there any other help from me?",
            "I need to go to 750 Tennant Station on a shared ride, i require a cab to go there",
            "What is the number of people cab for?",
            "It is for one people",
            "Please give confirmation details: You need to go to [destination] in a shared ride and cab is for [number_of_riders] people",
            "That is fine",
            "Your cab ride is booked and cab will reach you shortly",
            "Thank you very much",
            "Any more help from me?",
            "No, thanks for now",
            "Have a nice day"
        ]
    },
    {
        "intent_pos": 0,
        "dialogue": [
            "At what time i can watch it?",
            "Which movie you like to watch and what about your location?",
            "Could you find movies shown in Campbell and i like to watch Curse of La Llorona.",
            "On what date you want to watch?",
            "I like to watch on 7th of march at Pruneyard Cinemas.",
            "I searched [count] showtime for the movie and the show is at [show_time] in [theater_name].",
            "This is cool.",
            "Are you like to buy tickets?",
            "No, i will not purchase now and i need to get a cab to go there",
            "Will you be going to [destination]? what number of people in cab?",
            "Fine and it is for 1 people",
            "You require shared ride?",
            "The shared ride is fine",
            "Please give confirmation details: You need to go to [destination] on shared ride for [number_of_riders] people",
            "Fine and how much it costs?",
            "Your ride is booked and cab will reach you soon. it costs [ride_fare]",
            "What is the duration of the ride?",
            "The duration of ride is about [approximate_ride_duration] minutes.",
            "Thank you very much for your help.",
            "Any more help you need?",
            "No, thanks a lot for the help.",
            "Have a wonderful day."
        ]
    }
]